#!/usr/bin/python3
# encoding: utf-8
"""
@version: v1.0
@author: W_H_J
@license: Apache Licence
@contact: 415900617@qq.com
@software: PyCharm
@file: msgStaticClass.py
@time: 2020/12/17 9:22
@describe: 随机生成各类测试数据类
"""
import random
import sys
import os
import uuid
import time
from faker import Faker
sys.path.append(os.path.abspath(os.path.dirname(__file__) + '/' + '..'))
sys.path.append("..")
from FakerDoc import FakerDocText


class MsgStaticClass(FakerDocText, Faker):
    def __init__(self, *args):
        self.init_args = self.return_args(*args)
        Faker.__init__(self, *args)
        FakerDocText.__init__(self)
        self.today = time.strftime('%Y-%m-%d', time.localtime(time.time()))
    def return_args(self,*args):
        return args
    @staticmethod
    def random_name(name_length=3):
        """
        随机生成姓名
        :param name_length: 姓名长度，默认为3，如为2，则类似：张三，李四
        :return: 中文姓名
        """
        first_name = "赵钱孙李周吴郑王冯陈褚卫蒋沈韩杨朱秦尤许何吕施张孔曹严华金魏陶姜戚谢邹喻柏水窦章云苏潘葛奚范彭郎鲁韦昌马苗凤花方俞任袁柳酆鲍史唐费廉岑薛雷贺倪汤滕殷罗毕郝邬安常乐于时傅皮卞齐康伍余元卜顾孟平黄和穆萧尹姚邵湛汪祁毛禹狄米贝明臧计伏成戴谈宋茅庞熊纪舒屈项祝董梁杜阮蓝闵席季麻强贾路娄危江童颜郭梅盛林刁钟徐邱骆高夏蔡田樊胡凌霍虞万支柯昝管卢莫经房裘缪干解应宗丁宣贲邓郁单杭洪包诸左石崔吉钮龚程嵇邢滑裴陆荣翁"
        second_name = "艳晓高长成小春恨桃依秋依波香巧紫萱涵易忆之幻巧美倩安寒白亦惜玉碧春怜雪听南念蕾紫夏凌旋芷梦凌寒梦竹千凡丹蓉慧贞思菱平卉笑柳雪卉南蓉谷梦巧兰绿蝶飞荷佳蕊芷荷怀瑶慕易若芹紫安曼冬寻巧雅昕尔槐以旋初夏依丝怜南傲菡谷蕊笑槐飞兰笑卉迎荷佳音梦君妙绿觅雪寒安沛凝白容乐蓉映安依云映冬凡雁梦秋梦凡秋巧若云元容怀蕾灵寒天薇翠安乐琴宛南怀蕊白风访波亦凝易绿夜南曼凡亦巧青易冰真白萱友安海之小蕊又琴天风若松盼菡秋荷香彤语梦"
        third_name = "强鹏峰丽娟梅全澄邈德泽海超海阳海荣海逸海昌瀚钰瀚文涵亮涵煦明宇涵衍浩皛浩波浩博浩初浩宕浩歌浩广浩邈浩气浩思浩言鸿宝鸿波鸿博鸿才鸿畅鸿畴鸿达鸿德鸿飞鸿风鸿福鸿光鸿晖鸿朗鸿文鸿轩鸿煊鸿骞鸿远鸿云鸿哲鸿祯鸿志鸿卓嘉澍光济澎湃彭泽鹏池鹏海浦和浦泽瑞渊越泽博耘德运辰宇辰皓辰钊辰铭辰锟辰阳辰韦辰良辰沛晨轩晨涛晨濡晨潍鸿振吉星铭晨起运运凡运凯运鹏运浩运诚运良运鸿运锋运盛运升运杰运珧运骏运凯运乾维运运晟运莱运华耘豪"
        if name_length == 2:
            seed = random.randint(0, 1)
            if seed == 0:
                random_name = random.choice(list(first_name)) + random.choice(list(second_name))
            elif seed == 1:
                random_name = random.choice(list(first_name)) + random.choice(list(third_name))
        else:
            random_name = random.choice(list(first_name)) + random.choice(list(second_name)) + random.choice(
                list(third_name))
        return random_name

    @staticmethod
    def random_uuid(create_uuid=1, if_need_split=False):
        """
        随机生成UUID
        :param create_uuid: 生成规则：【1,2,3,4】
        （1：uuid1（）基于时间戳
　　　　    由MAC地址、当前时间戳、随机数字。保证全球范围内的唯一性。但是由于MAC地址使用会带来安全问题，局域网内使用IP代替MAC;
         2: uuid5() 基于名字和SAHI值，name:采用26个小写字母a~z及数字0~9组合随机生成
            通过计算名字和命名空间的SAHI散列值得到的，保证了同一命名空间中不同名字的唯一性，不同命名空间的唯一性。但是同一命名空间相同名字生成相同的uuid;
         3: uuid5() 同上， name:采用26个大写字母A~Z及数字0~9组合随机生成；
         4: uuid5() 同上， name:采用26个大写字母a~z、小写字母a~z及数字0~9组合随机生成；
        ）
        :param if_need_split: 是否需要“-”分隔符
        :return: UUID
        """
        str_seed_lower = 'abcdefghijklmnopqrstuvwxyz0123456789'
        str_seed_upper = str_seed_lower.upper()
        random_str_lower = "".join(random.sample(str_seed_lower, 32))
        random_str_upper = "".join(random.sample(str_seed_lower, 32))
        random_str_lower_upper = "".join(random.sample(str_seed_lower + str_seed_upper, 32))
        random_uuid = ""
        if create_uuid in [1, 2, 3, 4]:
            if create_uuid == 1:
                random_uuid = uuid.uuid1()
            elif create_uuid == 2:
                random_uuid = uuid.uuid5(uuid.NAMESPACE_DNS, random_str_lower)
            elif create_uuid == 3:
                random_uuid = uuid.uuid5(uuid.NAMESPACE_DNS, random_str_upper)
            elif create_uuid == 4:
                random_uuid = uuid.uuid5(uuid.NAMESPACE_DNS, random_str_lower_upper)
        else:
            random_uuid = uuid.uuid1()
        if if_need_split:
            return str(random_uuid).replace("-", "")
        else:
            return str(random_uuid)

    @staticmethod
    def random_age(age_min=20, age_max=65):
        """
        随机生成年龄
        :param age_min: 最小年龄，默认20
        :param age_max: 最大年龄，默认65
        :return: age
        """
        age = random.randint(int(age_min), int(age_max))
        return age

    @staticmethod
    def random_height(height_min=150, height_max=195):
        """
        随机生成身高
        :param height_min: 最低身高
        :param height_max: 最高身高
        :return: 身高
        """
        height = random.randint(int(height_min), int(height_max))
        return height

    def random_date(self, time_start="1971-01-01", time_end=None):
        """
        随机生成日期，可用于出生年月日等各类日期
        :param time_start: 开始日期，形如：1971-01-01，“-”分隔
        :param time_end: 结束日期，形如：2020-12-31，“-”分隔
        :return: 随机日期，形如：1983-03-25 04:41:09
        """
        year_s, month_s, day_s = time_start.split("-")
        if time_end is None:
            year_e, month_e, day_e = self.today.split("-")
        else:
            year_e, month_e, day_e = time_end.split("-")
        time_start = time.mktime((int(year_s), int(month_s), int(day_s), 0, 0, 0, 0, 0, 0))  # 设置开始日期时间元组
        time_end = time.mktime((int(year_e), int(month_e), int(day_e), 23, 59, 59, 0, 0, 0))  # 设置结束日期时间元组
        t = random.randint(time_start, time_end)  # 在开始和结束时间戳中随机取出一个
        date_touple = time.localtime(t)  # 将时间戳生成时间元组
        date = time.strftime("%Y-%m-%d %H:%M:%S", date_touple)  # 将时间元组转成格式化字符串（1976-05-21）
        return date

    @staticmethod
    def random_education():
        """
        随机生成学校、学历
        :return: [学校、学历]
        """
        str_school = '''北京大学	本科
中国人民大学	本科
清华大学	本科
北京交通大学	本科
北京工业大学	本科
北京航空航天大学	本科
北京理工大学	本科
北京科技大学	本科
北方工业大学	本科
北京化工大学	本科
北京工商大学	本科
北京服装学院	本科
北京邮电大学	本科
北京印刷学院	本科
北京建筑大学	本科
北京石油化工学院	本科
北京电子科技学院	本科
中国农业大学	本科
北京农学院	本科
北京林业大学	本科
北京协和医学院	本科
首都医科大学	本科
北京中医药大学	本科
北京师范大学	本科
首都师范大学	本科
首都体育学院	本科
北京外国语大学	本科
北京第二外国语学院	本科
北京语言大学	本科
中国传媒大学	本科
中央财经大学	本科
对外经济贸易大学	本科
北京物资学院	本科
首都经济贸易大学	本科
中国消防救援学院	本科
外交学院	本科
中国人民公安大学	本科
国际关系学院	本科
北京体育大学	本科
中央音乐学院	本科
中国音乐学院	本科
中央美术学院	本科
中央戏剧学院	本科
中国戏曲学院	本科
北京电影学院	本科
北京舞蹈学院	本科
中央民族大学	本科
中国政法大学	本科
华北电力大学	本科
中华女子学院	本科
北京信息科技大学	本科
中国矿业大学（北京）	本科
中国石油大学（北京）	本科
中国地质大学（北京）	本科
北京联合大学	本科
北京城市学院	本科
中国青年政治学院	本科
首钢工学院	本科
中国劳动关系学院	本科
首都师范大学科德学院	本科
北京工商大学嘉华学院	本科
北京邮电大学世纪学院	本科
北京工业大学耿丹学院	本科
北京警察学院	本科
北京第二外国语学院中瑞酒店管理学院	本科
中国科学院大学	本科
中国社会科学院大学	本科
北京工业职业技术学院	专科
北京信息职业技术学院	专科
北京电子科技职业学院	专科
北京京北职业技术学院	专科
北京交通职业技术学院	专科
北京青年政治学院	专科
北京农业职业学院	专科
北京政法职业学院	专科
北京财贸职业学院	专科
北京北大方正软件职业技术学院	专科
北京经贸职业学院	专科
北京经济技术职业学院	专科
北京戏曲艺术职业学院	专科
北京汇佳职业学院	专科
北京科技经营管理学院	专科
北京科技职业学院	专科
北京培黎职业学院	专科
北京经济管理职业学院	专科
北京劳动保障职业学院	专科
北京社会管理职业学院	专科
北京艺术传媒职业学院	专科
北京体育职业学院	专科
北京交通运输职业学院	专科
北京卫生职业学院	专科
北京网络职业学院	专科
复旦大学	本科
同济大学	本科
上海交通大学	本科
华东理工大学	本科
上海理工大学	本科
上海海事大学	本科
东华大学	本科
上海电力大学	本科
上海应用技术大学	本科
上海健康医学院	本科
上海海洋大学	本科
上海中医药大学	本科
华东师范大学	本科
上海师范大学	本科
上海外国语大学	本科
上海财经大学	本科
上海对外经贸大学	本科
上海海关学院	本科
华东政法大学	本科
上海体育学院	本科
上海音乐学院	本科
上海戏剧学院	本科
上海大学	本科
上海公安学院	本科
上海工程技术大学	本科
上海立信会计金融学院	本科
上海电机学院	本科
上海杉达学院	本科
上海政法学院	本科
上海第二工业大学	本科
上海商学院	本科
上海立达学院	本科
上海建桥学院	本科
上海兴伟学院	本科
上海中侨职业技术大学	本科
上海视觉艺术学院	本科
上海外国语大学贤达经济人文学院	本科
上海师范大学天华学院	本科
上海科技大学	本科
上海纽约大学	本科
上海旅游高等专科学校	专科
上海东海职业技术学院	专科
上海工商职业技术学院	专科
上海出版印刷高等专科学校	专科
上海行健职业学院	专科
上海城建职业学院	专科
上海交通职业技术学院	专科
上海海事职业技术学院	专科
上海电子信息职业技术学院	专科
上海震旦职业学院	专科
上海民远职业技术学院	专科
上海欧华职业技术学院	专科
上海思博职业技术学院	专科
上海工艺美术职业学院	专科
上海济光职业技术学院	专科
上海工商外国语职业学院	专科
上海科学技术职业学院	专科
上海农林职业技术学院	专科
上海邦德职业技术学院	专科
上海电影艺术职业学院	专科
上海中华职业技术学院	专科
上海工会管理职业学院	专科
上海民航职业技术学院	专科
西北大学	本科
西安交通大学	本科
西北工业大学	本科
西安理工大学	本科
西安电子科技大学	本科
西安工业大学	本科
西安建筑科技大学	本科
西安科技大学	本科
西安石油大学	本科
陕西科技大学	本科
西安工程大学	本科
长安大学	本科
西北农林科技大学	本科
陕西中医药大学	本科
陕西师范大学	本科
延安大学	本科
陕西理工大学	本科
宝鸡文理学院	本科
咸阳师范学院	本科
渭南师范学院	本科
西安外国语大学	本科
西北政法大学	本科
西安体育学院	本科
西安音乐学院	本科
西安美术学院	本科
西安文理学院	本科
榆林学院	本科
商洛学院	本科
安康学院	本科
西安培华学院	本科
西安财经大学	本科
西安邮电大学	本科
西安航空学院	本科
西安医学院	本科
西安欧亚学院	本科
西安外事学院	本科
西安翻译学院	本科
西京学院	本科
西安思源学院	本科
陕西国际商贸学院	本科
陕西服装工程学院	本科
西安交通工程学院	本科
西安交通大学城市学院	本科
西北大学现代学院	本科
西安建筑科技大学华清学院	本科
西安财经大学行知学院	本科
陕西科技大学镐京学院	本科
西安工商学院	本科
延安大学西安创新学院	本科
西安电子科技大学长安学院	本科
西安汽车职业大学	本科
西安明德理工学院	本科
西安信息职业大学	本科
长安大学兴华学院	本科
西安理工大学高科学院	本科
西安科技大学高新学院	本科
陕西学前师范学院	本科
陕西工业职业技术学院	专科
杨凌职业技术学院	专科
西安电力高等专科学校	专科
陕西能源职业技术学院	专科
陕西国防工业职业技术学院	专科
西安航空职业技术学院	专科
陕西财经职业技术学院	专科
陕西交通职业技术学院	专科
陕西职业技术学院	专科
西安高新科技职业学院	专科
西安城市建设职业学院	专科
陕西铁路工程职业技术学院	专科
宝鸡职业技术学院	专科
陕西航空职业技术学院	专科
陕西电子信息职业技术学院	专科
陕西邮电职业技术学院	专科
西安海棠职业学院	专科
西安健康工程职业学院	专科
陕西警官职业学院	专科
陕西经济管理职业技术学院	专科
西安铁路职业技术学院	专科
咸阳职业技术学院	专科
西安职业技术学院	专科
商洛职业技术学院	专科
汉中职业技术学院	专科
延安职业技术学院	专科
渭南职业技术学院	专科
安康职业技术学院	专科
铜川职业技术学院	专科
陕西青年职业学院	专科
陕西工商职业学院	专科
陕西旅游烹饪职业学院	专科
西安医学高等专科学校	专科
榆林职业技术学院	专科
陕西艺术职业学院	专科
神木职业技术学院	专科
宝鸡三和职业学院	专科
榆林能源科技职业学院	专科
陕西机电职业技术学院	专科
中山大学	本科
暨南大学	本科
汕头大学	本科
华南理工大学	本科
华南农业大学	本科
广东海洋大学	本科
广州医科大学	本科
广东医科大学	本科
广州中医药大学	本科
广东药科大学	本科
华南师范大学	本科
韶关学院	本科
惠州学院	本科
韩山师范学院	本科
岭南师范学院	本科
肇庆学院	本科
嘉应学院	本科
广州体育学院	本科
广州美术学院	本科
星海音乐学院	本科
广东技术师范大学	本科
深圳大学	本科
广东财经大学	本科
广东白云学院	本科
广州大学	本科
广州航海学院	本科
广东警官学院	本科
仲恺农业工程学院	本科
五邑大学	本科
广东金融学院	本科
电子科技大学中山学院	本科
广东石油化工学院	本科
东莞理工学院	本科
广东工业大学	本科
广东外语外贸大学	本科
佛山科学技术学院	本科
广东培正学院	本科
南方医科大学	本科
广东东软学院	本科
华南理工大学广州学院	本科
广州大学华软软件学院	本科
中山大学南方学院	本科
广东外语外贸大学南国商学院	本科
广东财经大学华商学院	本科
广东海洋大学寸金学院	本科
华南农业大学珠江学院	本科
广州理工学院	本科
北京师范大学珠海分校	本科
广东工业大学华立学院	本科
广州大学松田学院	本科
广州商学院	本科
北京理工大学珠海学院	本科
吉林大学珠海学院	本科
广州工商学院	本科
广州科技职业技术大学	本科
广东科技学院	本科
广东理工学院	本科
广东工商职业技术大学	本科
东莞理工学院城市学院	本科
中山大学新华学院	本科
广东第二师范学院	本科
南方科技大学	本科
深圳技术大学	本科
北京师范大学-香港浸会大学联合国际学院	本科
香港中文大学（深圳）	本科
深圳北理莫斯科大学	本科
广东以色列理工学院	本科
顺德职业技术学院	专科
广东轻工职业技术学院	专科
广东交通职业技术学院	专科
广东水利电力职业技术学院	专科
潮汕职业技术学院	专科
深圳职业技术学院	专科
广东南华工商职业学院	专科
私立华联学院	专科
广州民航职业技术学院	专科
广州番禺职业技术学院	专科
广东松山职业技术学院	专科
广东农工商职业技术学院	专科
广东新安职业技术学院	专科
佛山职业技术学院	专科
广东科学技术职业学院	专科
广东食品药品职业学院	专科
广州康大职业技术学院	专科
珠海艺术职业学院	专科
广东行政职业学院	专科
广东体育职业技术学院	专科
广东职业技术学院	专科
广东建设职业技术学院	专科
广东女子职业技术学院	专科
广东机电职业技术学院	专科
广东岭南职业技术学院	专科
汕尾职业技术学院	专科
罗定职业技术学院	专科
阳江职业技术学院	专科
河源职业技术学院	专科
广东邮电职业技术学院	专科
汕头职业技术学院	专科
揭阳职业技术学院	专科
深圳信息职业技术学院	专科
清远职业技术学院	专科
广东工贸职业技术学院	专科
广东司法警官职业学院	专科
广东亚视演艺职业学院	专科
广东省外语艺术职业学院	专科
广东文艺职业学院	专科
广州体育职业技术学院	专科
广州工程技术职业学院	专科
中山火炬职业技术学院	专科
江门职业技术学院	专科
茂名职业技术学院	专科
珠海城市职业技术学院	专科
广州涉外经济职业技术学院	专科
广州南洋理工职业学院	专科
惠州经济职业技术学院	专科
肇庆医学高等专科学校	专科
广州现代信息工程职业技术学院	专科
广东理工职业学院	专科
广州华南商贸职业学院	专科
广州华立科技职业学院	专科
广州城市职业学院	专科
广东工程职业技术学院	专科
广州铁路职业技术学院	专科
广东科贸职业学院	专科
广州科技贸易职业学院	专科
中山职业技术学院	专科
广州珠江职业技术学院	专科
广州松田职业学院	专科
广东文理职业学院	专科
广州城建职业学院	专科
东莞职业技术学院	专科
广东南方职业学院	专科
广州华商职业学院	专科
广州华夏职业学院	专科
广东环境保护工程职业学院	专科
广东青年职业学院	专科
广州东华职业学院	专科
广东创新科技职业学院	专科
广东舞蹈戏剧职业学院	专科
惠州卫生职业技术学院	专科
广东信息工程职业学院	专科
广东生态工程职业学院	专科
惠州城市职业学院	专科
广东碧桂园职业学院	专科
广东茂名健康职业学院	专科
广东酒店管理职业技术学院	专科
广东茂名幼儿师范专科学校	专科
广州卫生职业技术学院	专科
惠州工程职业学院	专科
广东江门中医药职业学院	专科
广东茂名农林科技职业学院	专科
广东江门幼儿师范高等专科学校	专科
广东财贸职业学院	专科
湛江幼儿师范专科学校	专科
河北大学	本科
河北工程大学	本科
河北地质大学	本科
河北工业大学	本科
华北理工大学	本科
河北科技大学	本科
河北建筑工程学院	本科
河北水利电力学院	本科
河北农业大学	本科
河北医科大学	本科
河北北方学院	本科
承德医学院	本科
河北师范大学	本科
保定学院	本科
河北民族师范学院	本科
唐山师范学院	本科
廊坊师范学院	本科
衡水学院	本科
石家庄学院	本科
邯郸学院	本科
邢台学院	本科
沧州师范学院	本科
石家庄铁道大学	本科
燕山大学	本科
河北科技师范学院	本科
唐山学院	本科
华北科技学院	本科
中国人民警察大学	本科
河北体育学院	本科
河北金融学院	本科
北华航天工业学院	本科
防灾科技学院	本科
河北经贸大学	本科
中央司法警官学院	本科
河北传媒学院	本科
河北工程技术学院	本科
河北美术学院	本科
河北科技学院	本科
河北外国语学院	本科
河北大学工商学院	本科
华北理工大学轻工学院	本科
河北科技大学理工学院	本科
河北师范大学汇华学院	本科
河北经贸大学经济管理学院	本科
河北医科大学临床学院	本科
华北电力大学科技学院	本科
河北工程大学科信学院	本科
河北工业大学城市学院	本科
燕山大学里仁学院	本科
石家庄铁道大学四方学院	本科
河北地质大学华信学院	本科
河北农业大学现代科技学院	本科
华北理工大学冀唐学院	本科
保定理工学院	本科
燕京理工学院	本科
北京中医药大学东方学院	本科
北京交通大学海滨学院	本科
河北东方学院	本科
河北中医学院	本科
张家口学院	本科
河北环境工程学院	本科
河北工业职业技术学院	专科
邯郸职业技术学院	专科
石家庄职业技术学院	专科
张家口职业技术学院	专科
承德石油高等专科学校	专科
邢台职业技术学院	专科
河北软件职业技术学院	专科
河北石油职业技术学院	专科
河北建材职业技术学院	专科
河北政法职业学院	专科
沧州职业技术学院	专科
河北能源职业技术学院	专科
石家庄铁路职业技术学院	专科
保定职业技术学院	专科
秦皇岛职业技术学院	专科
石家庄工程职业学院	专科
石家庄城市经济职业学院	专科
唐山职业技术学院	专科
衡水职业技术学院	专科
唐山工业职业技术学院	专科
邢台医学高等专科学校	专科
河北艺术职业学院	专科
河北旅游职业学院	专科
石家庄财经职业学院	专科
河北交通职业技术学院	专科
河北化工医药职业技术学院	专科
石家庄信息工程职业学院	专科
河北对外经贸职业学院	专科
保定电力职业技术学院	专科
河北机电职业技术学院	专科
渤海石油职业学院	专科
廊坊职业技术学院	专科
唐山科技职业技术学院	专科
石家庄邮电职业技术学院	专科
河北公安警察职业学院	专科
石家庄工商职业学院	专科
石家庄理工职业学院	专科
石家庄科技信息职业学院	专科
河北司法警官职业学院	专科
沧州医学高等专科学校	专科
河北女子职业技术学院	专科
石家庄医学高等专科学校	专科
石家庄经济职业学院	专科
冀中职业学院	专科
石家庄人民医学高等专科学校	专科
石家庄科技工程职业学院	专科
河北劳动关系职业学院	专科
石家庄科技职业学院	专科
泊头职业学院	专科
宣化科技职业学院	专科
廊坊燕京职业技术学院	专科
承德护理职业学院	专科
石家庄幼儿师范高等专科学校	专科
廊坊卫生职业学院	专科
河北轨道运输职业技术学院	专科
保定幼儿师范高等专科学校	专科
河北工艺美术职业学院	专科
渤海理工职业学院	专科
唐山幼儿师范高等专科学校	专科
曹妃甸职业技术学院	专科
承德应用技术职业学院	专科
邯郸幼儿师范高等专科学校	专科
邯郸科技职业学院	专科
唐山海运职业学院	专科
山东大学	本科
中国海洋大学	本科
山东科技大学	本科
中国石油大学（华东）	本科
青岛科技大学	本科
济南大学	本科
青岛理工大学	本科
山东建筑大学	本科
齐鲁工业大学	本科
山东理工大学	本科
山东农业大学	本科
青岛农业大学	本科
潍坊医学院	本科
山东第一医科大学	本科
滨州医学院	本科
山东中医药大学	本科
济宁医学院	本科
山东师范大学	本科
曲阜师范大学	本科
聊城大学	本科
德州学院	本科
滨州学院	本科
鲁东大学	本科
临沂大学	本科
泰山学院	本科
济宁学院	本科
菏泽学院	本科
山东财经大学	本科
山东体育学院	本科
山东艺术学院	本科
齐鲁医药学院	本科
青岛滨海学院	本科
枣庄学院	本科
山东工艺美术学院	本科
青岛大学	本科
烟台大学	本科
潍坊学院	本科
山东警察学院	本科
山东交通学院	本科
山东工商学院	本科
山东女子学院	本科
烟台南山学院	本科
潍坊科技学院	本科
山东英才学院	本科
青岛恒星科技学院	本科
青岛黄海学院	本科
山东现代学院	本科
山东协和学院	本科
山东工程职业技术大学	本科
烟台大学文经学院	本科
聊城大学东昌学院	本科
青岛理工大学琴岛学院	本科
潍坊理工学院	本科
山东财经大学燕山学院	本科
中国石油大学胜利学院	本科
山东外国语职业技术大学	本科
山东科技大学泰山科技学院	本科
山东华宇工学院	本科
山东外事职业大学	本科
青岛工学院	本科
青岛农业大学海都学院	本科
齐鲁理工学院	本科
山东财经大学东方学院	本科
济南大学泉城学院	本科
山东政法学院	本科
齐鲁师范学院	本科
山东青年政治学院	本科
北京电影学院现代创意媒体学院	本科
山东管理学院	本科
山东农业工程学院	本科
山东医学高等专科学校	专科
菏泽医学专科学校	专科
山东商业职业技术学院	专科
山东电力高等专科学校	专科
日照职业技术学院	专科
曲阜远东职业技术学院	专科
青岛职业技术学院	专科
威海职业学院	专科
山东职业学院	专科
山东劳动职业技术学院	专科
莱芜职业技术学院	专科
济宁职业技术学院	专科
潍坊职业学院	专科
烟台职业学院	专科
东营职业学院	专科
聊城职业技术学院	专科
滨州职业学院	专科
山东科技职业学院	专科
山东服装职业学院	专科
德州科技职业学院	专科
山东力明科技职业学院	专科
山东圣翰财贸职业学院	专科
山东水利职业学院	专科
山东畜牧兽医职业学院	专科
青岛飞洋职业技术学院	专科
东营科技职业学院	专科
山东交通职业学院	专科
淄博职业学院	专科
山东外贸职业学院	专科
青岛酒店管理职业技术学院	专科
山东信息职业技术学院	专科
青岛港湾职业技术学院	专科
山东胜利职业学院	专科
山东经贸职业学院	专科
山东工业职业学院	专科
山东化工职业学院	专科
青岛求实职业技术学院	专科
济南职业学院	专科
烟台工程职业技术学院	专科
潍坊工商职业学院	专科
德州职业技术学院	专科
枣庄科技职业学院	专科
淄博师范高等专科学校	专科
山东中医药高等专科学校	专科
济南工程职业技术学院	专科
山东电子职业技术学院	专科
山东旅游职业学院	专科
山东铝业职业学院	专科
山东杏林科技职业学院	专科
泰山职业技术学院	专科
山东药品食品职业学院	专科
山东商务职业学院	专科
山东轻工职业学院	专科
山东城市建设职业学院	专科
烟台汽车工程职业学院	专科
山东司法警官职业学院	专科
菏泽家政职业学院	专科
山东传媒职业学院	专科
临沂职业学院	专科
枣庄职业学院	专科
山东理工职业学院	专科
山东文化产业职业学院	专科
青岛远洋船员职业学院	专科
济南幼儿师范高等专科学校	专科
济南护理职业学院	专科
泰山护理职业学院	专科
山东海事职业学院	专科
潍坊护理职业学院	专科
潍坊工程职业学院	专科
菏泽职业学院	专科
山东艺术设计职业学院	专科
威海海洋职业学院	专科
山东特殊教育职业学院	专科
烟台黄金职业学院	专科
日照航海工程职业学院	专科
青岛工程职业学院	专科
青岛幼儿师范高等专科学校	专科
烟台幼儿师范高等专科学校	专科
烟台文化旅游职业学院	专科
临沂科技职业学院	专科
青岛航空科技职业学院	专科
潍坊环境工程职业学院	专科'''
        list_school = []
        for x in str_school.split("\n"):
            list_school.append(x.split("\t"))
        return random.choice(list_school)

    @staticmethod
    def random_education_level(level=2):
        """
        随机生成学历
        :param level:
            0： ["小学", "初中", "中专", "高中"]；
            1：["大专","本科","硕士","博士"]；
            2：混合0,1;
            3: 教育类别：["学历教育", "培训教育"];
            4: 学习形式：["全日制", "非全日制"]；
            5：完成情况：["毕业"]*7+["肄业"]*1+["结业"]*1+["在读"]*1
        :return:
        """
        list_edu_level_low = ["小学", "初中", "中专", "高中"]
        # 学历比例：大专4：本科3：硕士：2：博士：1
        list_edu_level = ["大专", "大专", "大专", "大专", "本科", "本科", "本科", "硕士", "硕士", "博士"]
        list_edu_class = ["学历教育", "培训教育"]
        list_study_class = ["全日制", "非全日制"]
        list_back = ["毕业"]*7+["肄业"]*1+["结业"]*1+["在读"]*1
        if level == 0:
            return random.choice(list_edu_level_low)
        elif level == 1:
            return random.choice(list_edu_level_low + list_edu_level)
        elif level == 2:
            return random.choice(list_edu_level)
        elif level == 3:
            return random.choice(list_edu_class)
        elif level == 4:
            return random.choice(list_study_class)
        elif level == 5:
            return random.choice(list_back)

    @staticmethod
    def random_major():
        """
        随机生成专业
        :return: 专业
        """
        str_major = """应用经济学
国民经济学
区域经济学
财政学
金融学
产业经济学
国际贸易学
劳动经济学
统计学
数量经济学
国防经济
理论经济学
政治经济学
经济思想史
经济史
西方经济学
世界经济
人口、资源与环境经济学
法学理论
法律史
宪法学与行政法学
刑法学
民商法学
诉讼法学
经济法学
环境与资源保护法学
国际法学
军事法学
基础数学
计算数学
概率论与数理统计
应用数学
运筹学与控制论
机械制造及其自动化
机械电子工程
机械设计及理论
车辆工程
光学工程
计算机系统结构
计算机软件与理论
计算机应用技术
交通运输工程
软件工程
通信工程
网络工程
会计学
计算机系统结构
计算机软件与理论
道路与铁道工程
交通信息工程及控制
交通运输规划与管理
载运工具运用工程
管理科学
信息管理与信息系统
工程管理
房地产开发与管理
工程造价
保密管理
邮政管理
大数据管理与应用
工程审计
计算金融
应急管理
工商管理
市场营销
会计学
财务管理
国际商务
人力资源管理
审计学
资产评估
物业管理
文化产业管理
劳动关系
体育经济与管理
财务会计教育
市场营销教育
零售业管理
公共事业管理
行政管理
劳动与社会保障
土地资源管理
城市管理
海关管理
交通管理
海事管理
公共关系学
健康服务与管理
海警后勤管理
医疗产品管理
医疗保险
养老服务管理
计算机科学与技术
软件工程
网络工程
信息安全
物联网工程
数字媒体技术
智能科学与技术
空间信息与数字技术
电子与计算机工程
数据科学与大数据技术
网络空间安全
新媒体技术
电影制作
保密技术
服务科学与工程
虚拟现实技术
区块链工程"""
        return random.choice(str_major.split("\n"))

    @staticmethod
    def random_nation(flag=True):
        """
        随机生成民族
        :param flag:True，随机选取56个民族，False：汉族
        :return: 民族
        """
        str_nation = """蒙古族
藏族
苗族
壮族
回族
维吾尔族
彝族
布依族
朝鲜族
侗族
白族
哈尼族
傣族
傈僳族
畲族
拉祜族
满族
瑶族
土家族
哈萨克族
黎族
佤族
高山族
水族
东乡族
景颇族
土族
仫佬族
布朗族
毛南族
锡伯族
普米族
纳西族
柯尔克孜族
达斡尔族
羌族
撒拉族
仡佬族
阿昌族
塔吉克族
怒族
俄罗斯族
德昂族
裕固族
塔塔尔族
鄂伦春族
门巴族
基诺族
乌孜别克族
鄂温克族
保安族
京族
独龙族
赫哲族
珞巴族
汉族"""
        if flag:
            return random.choice(str_nation.split("\n"))
        else:
            return "汉族"

    @staticmethod
    def random_province(flag=0, native_place=False):
        """
        随机生成省市区/县、籍贯
        :param flag:
            0：返回省；
            1：返回市；
            2：返回省、市；
            3：
                native_place 为True，按“-”拼接，返回省-市-区
                native_place 为False，直接返回省、市、区
        :param native_place: 籍贯/出生地
        :return:
        """
        if flag in [0, 1, 2, 3]:
            list_msg = [{"name": "北京市", "city": [{"name": "北京市",
                                                  "area": ["东城区", "西城区", "朝阳区", "丰台区", "石景山区", "海淀区", "门头沟区", "房山区",
                                                           "通州区", "顺义区", "昌平区", "大兴区", "怀柔区", "平谷区", "密云区", "延庆区"]}]},
                        {"name": "天津市", "city": [{"name": "天津市",
                                                  "area": ["和平区", "河东区", "河西区", "南开区", "河北区", "红桥区", "东丽区", "西青区",
                                                           "津南区", "北辰区", "武清区", "宝坻区", "滨海新区", "宁河区", "静海区", "蓟州区"]}]},
                        {"name": "河北省", "city": [{"name": "石家庄市",
                                                  "area": ["长安区", "桥西区", "新华区", "井陉矿区", "裕华区", "藁城区", "鹿泉区", "栾城区",
                                                           "井陉县", "正定县", "行唐县", "灵寿县", "高邑县", "深泽县", "赞皇县", "无极县",
                                                           "平山县", "元氏县", "赵县", "晋州市", "新乐市"]}, {"name": "唐山市",
                                                                                                "area": ["路南区", "路北区",
                                                                                                         "古冶区", "开平区",
                                                                                                         "丰南区", "丰润区",
                                                                                                         "曹妃甸区", "滦县",
                                                                                                         "滦南县", "乐亭县",
                                                                                                         "迁西县", "玉田县",
                                                                                                         "遵化市", "迁安市"]},
                                                 {"name": "秦皇岛市",
                                                  "area": ["海港区", "山海关区", "北戴河区", "抚宁区", "青龙满族自治县", "昌黎县", "卢龙县"]},
                                                 {"name": "邯郸市",
                                                  "area": ["邯山区", "丛台区", "复兴区", "峰峰矿区", "邯郸县", "临漳县", "成安县", "大名县",
                                                           "涉县", "磁县", "肥乡县", "永年县", "邱县", "鸡泽县", "广平县", "馆陶县", "魏县",
                                                           "曲周县", "武安市"]}, {"name": "邢台市",
                                                                            "area": ["桥东区", "桥西区", "邢台县", "临城县", "内丘县",
                                                                                     "柏乡县", "隆尧县", "任县", "南和县", "宁晋县",
                                                                                     "巨鹿县", "新河县", "广宗县", "平乡县", "威县",
                                                                                     "清河县", "临西县", "南宫市", "沙河市"]},
                                                 {"name": "保定市",
                                                  "area": ["竞秀区", "莲池区", "满城区", "清苑区", "徐水区", "涞水县", "阜平县", "定兴县", "唐县",
                                                           "高阳县", "容城县", "涞源县", "望都县", "安新县", "易县", "曲阳县", "蠡县", "顺平县",
                                                           "博野县", "雄县", "涿州市", "安国市", "高碑店市"]}, {"name": "张家口市",
                                                                                                 "area": ["桥东区", "桥西区",
                                                                                                          "宣化区", "下花园区",
                                                                                                          "万全区", "崇礼区",
                                                                                                          "张北县", "康保县",
                                                                                                          "沽源县", "尚义县",
                                                                                                          "蔚县", "阳原县",
                                                                                                          "怀安县", "怀来县",
                                                                                                          "涿鹿县",
                                                                                                          "赤城县"]},
                                                 {"name": "承德市",
                                                  "area": ["双桥区", "双滦区", "鹰手营子矿区", "承德县", "兴隆县", "平泉县", "滦平县", "隆化县",
                                                           "丰宁满族自治县", "宽城满族自治县", "围场满族蒙古族自治县"]}, {"name": "沧州市",
                                                                                                  "area": ["新华区", "运河区",
                                                                                                           "沧县", "青县",
                                                                                                           "东光县", "海兴县",
                                                                                                           "盐山县", "肃宁县",
                                                                                                           "南皮县", "吴桥县",
                                                                                                           "献县",
                                                                                                           "孟村回族自治县",
                                                                                                           "泊头市", "任丘市",
                                                                                                           "黄骅市",
                                                                                                           "河间市"]},
                                                 {"name": "廊坊市",
                                                  "area": ["安次区", "广阳区", "固安县", "永清县", "香河县", "大城县", "文安县", "大厂回族自治县",
                                                           "霸州市", "三河市"]}, {"name": "衡水市",
                                                                            "area": ["桃城区", "冀州区", "枣强县", "武邑县", "武强县",
                                                                                     "饶阳县", "安平县", "故城县", "景县", "阜城县",
                                                                                     "深州市"]},
                                                 {"name": "省直辖县级行政区划", "area": ["定州市", "辛集市"]}]}, {"name": "山西省",
                                                                                                   "city": [
                                                                                                       {"name": "太原市",
                                                                                                        "area": ["小店区",
                                                                                                                 "迎泽区",
                                                                                                                 "杏花岭区",
                                                                                                                 "尖草坪区",
                                                                                                                 "万柏林区",
                                                                                                                 "晋源区",
                                                                                                                 "清徐县",
                                                                                                                 "阳曲县",
                                                                                                                 "娄烦县",
                                                                                                                 "古交市"]},
                                                                                                       {"name": "大同市",
                                                                                                        "area": ["城区",
                                                                                                                 "矿区",
                                                                                                                 "南郊区",
                                                                                                                 "新荣区",
                                                                                                                 "阳高县",
                                                                                                                 "天镇县",
                                                                                                                 "广灵县",
                                                                                                                 "灵丘县",
                                                                                                                 "浑源县",
                                                                                                                 "左云县",
                                                                                                                 "大同县"]},
                                                                                                       {"name": "阳泉市",
                                                                                                        "area": ["城区",
                                                                                                                 "矿区",
                                                                                                                 "郊区",
                                                                                                                 "平定县",
                                                                                                                 "盂县"]},
                                                                                                       {"name": "长治市",
                                                                                                        "area": ["城区",
                                                                                                                 "郊区",
                                                                                                                 "长治县",
                                                                                                                 "襄垣县",
                                                                                                                 "屯留县",
                                                                                                                 "平顺县",
                                                                                                                 "黎城县",
                                                                                                                 "壶关县",
                                                                                                                 "长子县",
                                                                                                                 "武乡县",
                                                                                                                 "沁县",
                                                                                                                 "沁源县",
                                                                                                                 "潞城市"]},
                                                                                                       {"name": "晋城市",
                                                                                                        "area": ["城区",
                                                                                                                 "沁水县",
                                                                                                                 "阳城县",
                                                                                                                 "陵川县",
                                                                                                                 "泽州县",
                                                                                                                 "高平市"]},
                                                                                                       {"name": "朔州市",
                                                                                                        "area": ["朔城区",
                                                                                                                 "平鲁区",
                                                                                                                 "山阴县",
                                                                                                                 "应县",
                                                                                                                 "右玉县",
                                                                                                                 "怀仁县"]},
                                                                                                       {"name": "晋中市",
                                                                                                        "area": ["榆次区",
                                                                                                                 "榆社县",
                                                                                                                 "左权县",
                                                                                                                 "和顺县",
                                                                                                                 "昔阳县",
                                                                                                                 "寿阳县",
                                                                                                                 "太谷县",
                                                                                                                 "祁县",
                                                                                                                 "平遥县",
                                                                                                                 "灵石县",
                                                                                                                 "介休市"]},
                                                                                                       {"name": "运城市",
                                                                                                        "area": ["盐湖区",
                                                                                                                 "临猗县",
                                                                                                                 "万荣县",
                                                                                                                 "闻喜县",
                                                                                                                 "稷山县",
                                                                                                                 "新绛县",
                                                                                                                 "绛县",
                                                                                                                 "垣曲县",
                                                                                                                 "夏县",
                                                                                                                 "平陆县",
                                                                                                                 "芮城县",
                                                                                                                 "永济市",
                                                                                                                 "河津市"]},
                                                                                                       {"name": "忻州市",
                                                                                                        "area": ["忻府区",
                                                                                                                 "定襄县",
                                                                                                                 "五台县",
                                                                                                                 "代县",
                                                                                                                 "繁峙县",
                                                                                                                 "宁武县",
                                                                                                                 "静乐县",
                                                                                                                 "神池县",
                                                                                                                 "五寨县",
                                                                                                                 "岢岚县",
                                                                                                                 "河曲县",
                                                                                                                 "保德县",
                                                                                                                 "偏关县",
                                                                                                                 "原平市"]},
                                                                                                       {"name": "临汾市",
                                                                                                        "area": ["尧都区",
                                                                                                                 "曲沃县",
                                                                                                                 "翼城县",
                                                                                                                 "襄汾县",
                                                                                                                 "洪洞县",
                                                                                                                 "古县",
                                                                                                                 "安泽县",
                                                                                                                 "浮山县",
                                                                                                                 "吉县",
                                                                                                                 "乡宁县",
                                                                                                                 "大宁县",
                                                                                                                 "隰县",
                                                                                                                 "永和县",
                                                                                                                 "蒲县",
                                                                                                                 "汾西县",
                                                                                                                 "侯马市",
                                                                                                                 "霍州市"]},
                                                                                                       {"name": "吕梁市",
                                                                                                        "area": ["离石区",
                                                                                                                 "文水县",
                                                                                                                 "交城县",
                                                                                                                 "兴县",
                                                                                                                 "临县",
                                                                                                                 "柳林县",
                                                                                                                 "石楼县",
                                                                                                                 "岚县",
                                                                                                                 "方山县",
                                                                                                                 "中阳县",
                                                                                                                 "交口县",
                                                                                                                 "孝义市",
                                                                                                                 "汾阳市"]}]},
                        {"name": "内蒙古自治区", "city": [{"name": "呼和浩特市",
                                                     "area": ["新城区", "回民区", "玉泉区", "赛罕区", "土默特左旗", "托克托县", "和林格尔县",
                                                              "清水河县", "武川县"]}, {"name": "包头市",
                                                                                "area": ["东河区", "昆都仑区", "青山区", "石拐区",
                                                                                         "白云鄂博矿区", "九原区", "土默特右旗",
                                                                                         "固阳县", "达尔罕茂明安联合旗"]},
                                                    {"name": "乌海市", "area": ["海勃湾区", "海南区", "乌达区"]}, {"name": "赤峰市",
                                                                                                      "area": ["红山区",
                                                                                                               "元宝山区",
                                                                                                               "松山区",
                                                                                                               "阿鲁科尔沁旗",
                                                                                                               "巴林左旗",
                                                                                                               "巴林右旗",
                                                                                                               "林西县",
                                                                                                               "克什克腾旗",
                                                                                                               "翁牛特旗",
                                                                                                               "喀喇沁旗",
                                                                                                               "宁城县",
                                                                                                               "敖汉旗"]},
                                                    {"name": "通辽市",
                                                     "area": ["科尔沁区", "科尔沁左翼中旗", "科尔沁左翼后旗", "开鲁县", "库伦旗", "奈曼旗", "扎鲁特旗",
                                                              "霍林郭勒市"]}, {"name": "鄂尔多斯市",
                                                                          "area": ["东胜区", "康巴什区", "达拉特旗", "准格尔旗",
                                                                                   "鄂托克前旗", "鄂托克旗", "杭锦旗", "乌审旗",
                                                                                   "伊金霍洛旗"]}, {"name": "呼伦贝尔市",
                                                                                               "area": ["海拉尔区", "扎赉诺尔区",
                                                                                                        "阿荣旗",
                                                                                                        "莫力达瓦达斡尔族自治旗",
                                                                                                        "鄂伦春自治旗",
                                                                                                        "鄂温克族自治旗",
                                                                                                        "陈巴尔虎旗",
                                                                                                        "新巴尔虎左旗",
                                                                                                        "新巴尔虎右旗",
                                                                                                        "满洲里市", "牙克石市",
                                                                                                        "扎兰屯市", "额尔古纳市",
                                                                                                        "根河市"]},
                                                    {"name": "巴彦淖尔市",
                                                     "area": ["临河区", "五原县", "磴口县", "乌拉特前旗", "乌拉特中旗", "乌拉特后旗", "杭锦后旗"]},
                                                    {"name": "乌兰察布市",
                                                     "area": ["集宁区", "卓资县", "化德县", "商都县", "兴和县", "凉城县", "察哈尔右翼前旗",
                                                              "察哈尔右翼中旗", "察哈尔右翼后旗", "四子王旗", "丰镇市"]}, {"name": "兴安盟",
                                                                                                      "area": ["乌兰浩特市",
                                                                                                               "阿尔山市",
                                                                                                               "科尔沁右翼前旗",
                                                                                                               "科尔沁右翼中旗",
                                                                                                               "扎赉特旗",
                                                                                                               "突泉县"]},
                                                    {"name": "锡林郭勒盟",
                                                     "area": ["二连浩特市", "锡林浩特市", "阿巴嘎旗", "苏尼特左旗", "苏尼特右旗", "东乌珠穆沁旗",
                                                              "西乌珠穆沁旗", "太仆寺旗", "镶黄旗", "正镶白旗", "正蓝旗", "多伦县"]},
                                                    {"name": "阿拉善盟", "area": ["阿拉善左旗", "阿拉善右旗", "额济纳旗"]}]},
                        {"name": "辽宁省", "city": [{"name": "沈阳市",
                                                  "area": ["和平区", "沈河区", "大东区", "皇姑区", "铁西区", "苏家屯区", "浑南区", "沈北新区",
                                                           "于洪区", "辽中区", "康平县", "法库县", "新民市"]}, {"name": "大连市",
                                                                                                 "area": ["中山区", "西岗区",
                                                                                                          "沙河口区",
                                                                                                          "甘井子区",
                                                                                                          "旅顺口区", "金州区",
                                                                                                          "普兰店区", "长海县",
                                                                                                          "瓦房店市",
                                                                                                          "庄河市"]},
                                                 {"name": "鞍山市",
                                                  "area": ["铁东区", "铁西区", "立山区", "千山区", "台安县", "岫岩满族自治县", "海城市"]},
                                                 {"name": "抚顺市",
                                                  "area": ["新抚区", "东洲区", "望花区", "顺城区", "抚顺县", "新宾满族自治县", "清原满族自治县"]},
                                                 {"name": "本溪市",
                                                  "area": ["平山区", "溪湖区", "明山区", "南芬区", "本溪满族自治县", "桓仁满族自治县"]},
                                                 {"name": "丹东市",
                                                  "area": ["元宝区", "振兴区", "振安区", "宽甸满族自治县", "东港市", "凤城市"]},
                                                 {"name": "锦州市",
                                                  "area": ["古塔区", "凌河区", "太和区", "黑山县", "义县", "凌海市", "北镇市"]},
                                                 {"name": "营口市", "area": ["站前区", "西市区", "鲅鱼圈区", "老边区", "盖州市", "大石桥市"]},
                                                 {"name": "阜新市",
                                                  "area": ["海州区", "新邱区", "太平区", "清河门区", "细河区", "阜新蒙古族自治县", "彰武县"]},
                                                 {"name": "辽阳市",
                                                  "area": ["白塔区", "文圣区", "宏伟区", "弓长岭区", "太子河区", "辽阳县", "灯塔市"]},
                                                 {"name": "盘锦市", "area": ["双台子区", "兴隆台区", "大洼区", "盘山县"]},
                                                 {"name": "铁岭市",
                                                  "area": ["银州区", "清河区", "铁岭县", "西丰县", "昌图县", "调兵山市", "开原市"]},
                                                 {"name": "朝阳市",
                                                  "area": ["双塔区", "龙城区", "朝阳县", "建平县", "喀喇沁左翼蒙古族自治县", "北票市", "凌源市"]},
                                                 {"name": "葫芦岛市", "area": ["连山区", "龙港区", "南票区", "绥中县", "建昌县", "兴城市"]}]},
                        {"name": "吉林省", "city": [{"name": "长春市",
                                                  "area": ["南关区", "宽城区", "朝阳区", "二道区", "绿园区", "双阳区", "九台区", "农安县",
                                                           "榆树市", "德惠市"]}, {"name": "吉林市",
                                                                            "area": ["昌邑区", "龙潭区", "船营区", "丰满区", "永吉县",
                                                                                     "蛟河市", "桦甸市", "舒兰市", "磐石市"]},
                                                 {"name": "四平市",
                                                  "area": ["铁西区", "铁东区", "梨树县", "伊通满族自治县", "公主岭市", "双辽市"]},
                                                 {"name": "辽源市", "area": ["龙山区", "西安区", "东丰县", "东辽县"]}, {"name": "通化市",
                                                                                                         "area": ["东昌区",
                                                                                                                  "二道江区",
                                                                                                                  "通化县",
                                                                                                                  "辉南县",
                                                                                                                  "柳河县",
                                                                                                                  "梅河口市",
                                                                                                                  "集安市"]},
                                                 {"name": "白山市",
                                                  "area": ["浑江区", "江源区", "抚松县", "靖宇县", "长白朝鲜族自治县", "临江市"]},
                                                 {"name": "松原市", "area": ["宁江区", "前郭尔罗斯蒙古族自治县", "长岭县", "乾安县", "扶余市"]},
                                                 {"name": "白城市", "area": ["洮北区", "镇赉县", "通榆县", "洮南市", "大安市"]},
                                                 {"name": "延边朝鲜族自治州",
                                                  "area": ["延吉市", "图们市", "敦化市", "珲春市", "龙井市", "和龙市", "汪清县", "安图县"]}]},
                        {"name": "黑龙江省", "city": [{"name": "哈尔滨市",
                                                   "area": ["道里区", "南岗区", "道外区", "平房区", "松北区", "香坊区", "呼兰区", "阿城区",
                                                            "双城区", "依兰县", "方正县", "宾县", "巴彦县", "木兰县", "通河县", "延寿县",
                                                            "尚志市", "五常市"]}, {"name": "齐齐哈尔市",
                                                                             "area": ["龙沙区", "建华区", "铁锋区", "昂昂溪区",
                                                                                      "富拉尔基区", "碾子山区", "梅里斯达斡尔族区",
                                                                                      "龙江县", "依安县", "泰来县", "甘南县", "富裕县",
                                                                                      "克山县", "克东县", "拜泉县", "讷河市"]},
                                                  {"name": "鸡西市",
                                                   "area": ["鸡冠区", "恒山区", "滴道区", "梨树区", "城子河区", "麻山区", "鸡东县", "虎林市",
                                                            "密山市"]}, {"name": "鹤岗市",
                                                                      "area": ["向阳区", "工农区", "南山区", "兴安区", "东山区", "兴山区",
                                                                               "萝北县", "绥滨县"]}, {"name": "双鸭山市",
                                                                                                "area": ["尖山区", "岭东区",
                                                                                                         "四方台区", "宝山区",
                                                                                                         "集贤县", "友谊县",
                                                                                                         "宝清县", "饶河县"]},
                                                  {"name": "大庆市",
                                                   "area": ["萨尔图区", "龙凤区", "让胡路区", "红岗区", "大同区", "肇州县", "肇源县", "林甸县",
                                                            "杜尔伯特蒙古族自治县"]}, {"name": "伊春市",
                                                                             "area": ["伊春区", "南岔区", "友好区", "西林区", "翠峦区",
                                                                                      "新青区", "美溪区", "金山屯区", "五营区",
                                                                                      "乌马河区", "汤旺河区", "带岭区", "乌伊岭区",
                                                                                      "红星区", "上甘岭区", "嘉荫县", "铁力市"]},
                                                  {"name": "佳木斯市",
                                                   "area": ["向阳区", "前进区", "东风区", "郊区", "桦南县", "桦川县", "汤原县", "同江市",
                                                            "富锦市", "抚远市"]},
                                                  {"name": "七台河市", "area": ["新兴区", "桃山区", "茄子河区", "勃利县"]},
                                                  {"name": "牡丹江市",
                                                   "area": ["东安区", "阳明区", "爱民区", "西安区", "林口县", "绥芬河市", "海林市", "宁安市",
                                                            "穆棱市", "东宁市"]},
                                                  {"name": "黑河市", "area": ["爱辉区", "嫩江县", "逊克县", "孙吴县", "北安市", "五大连池市"]},
                                                  {"name": "绥化市",
                                                   "area": ["北林区", "望奎县", "兰西县", "青冈县", "庆安县", "明水县", "绥棱县", "安达市",
                                                            "肇东市", "海伦市"]},
                                                  {"name": "大兴安岭地区", "area": ["呼玛县", "塔河县", "漠河县"]}]}, {"name": "上海市",
                                                                                                        "city": [{
                                                                                                                     "name": "上海市",
                                                                                                                     "area": [
                                                                                                                         "黄浦区",
                                                                                                                         "徐汇区",
                                                                                                                         "长宁区",
                                                                                                                         "静安区",
                                                                                                                         "普陀区",
                                                                                                                         "虹口区",
                                                                                                                         "杨浦区",
                                                                                                                         "闵行区",
                                                                                                                         "宝山区",
                                                                                                                         "嘉定区",
                                                                                                                         "浦东新区",
                                                                                                                         "金山区",
                                                                                                                         "松江区",
                                                                                                                         "青浦区",
                                                                                                                         "奉贤区",
                                                                                                                         "崇明区"]}]},
                        {"name": "江苏省", "city": [{"name": "南京市",
                                                  "area": ["玄武区", "秦淮区", "建邺区", "鼓楼区", "浦口区", "栖霞区", "雨花台区", "江宁区",
                                                           "六合区", "溧水区", "高淳区"]}, {"name": "无锡市",
                                                                                   "area": ["锡山区", "惠山区", "滨湖区", "梁溪区",
                                                                                            "新吴区", "江阴市", "宜兴市"]},
                                                 {"name": "徐州市",
                                                  "area": ["鼓楼区", "云龙区", "贾汪区", "泉山区", "铜山区", "丰县", "沛县", "睢宁县", "新沂市",
                                                           "邳州市"]},
                                                 {"name": "常州市", "area": ["天宁区", "钟楼区", "新北区", "武进区", "金坛区", "溧阳市"]},
                                                 {"name": "苏州市",
                                                  "area": ["虎丘区", "吴中区", "相城区", "姑苏区", "吴江区", "常熟市", "张家港市", "昆山市",
                                                           "太仓市"]}, {"name": "南通市",
                                                                     "area": ["崇川区", "港闸区", "通州区", "海安县", "如东县", "启东市",
                                                                              "如皋市", "海门市"]},
                                                 {"name": "连云港市", "area": ["连云区", "海州区", "赣榆区", "东海县", "灌云县", "灌南县"]},
                                                 {"name": "淮安市",
                                                  "area": ["淮安区", "淮阴区", "清江浦区", "洪泽区", "涟水县", "盱眙县", "金湖县"]},
                                                 {"name": "盐城市",
                                                  "area": ["亭湖区", "盐都区", "大丰区", "响水县", "滨海县", "阜宁县", "射阳县", "建湖县",
                                                           "东台市"]},
                                                 {"name": "扬州市", "area": ["广陵区", "邗江区", "江都区", "宝应县", "仪征市", "高邮市"]},
                                                 {"name": "镇江市", "area": ["京口区", "润州区", "丹徒区", "丹阳市", "扬中市", "句容市"]},
                                                 {"name": "泰州市", "area": ["海陵区", "高港区", "姜堰区", "兴化市", "靖江市", "泰兴市"]},
                                                 {"name": "宿迁市", "area": ["宿城区", "宿豫区", "沭阳县", "泗阳县", "泗洪县"]}]},
                        {"name": "浙江省", "city": [{"name": "杭州市",
                                                  "area": ["上城区", "下城区", "江干区", "拱墅区", "西湖区", "滨江区", "萧山区", "余杭区",
                                                           "富阳区", "桐庐县", "淳安县", "建德市", "临安市"]}, {"name": "宁波市",
                                                                                                 "area": ["海曙区", "江东区",
                                                                                                          "江北区", "北仑区",
                                                                                                          "镇海区", "鄞州区",
                                                                                                          "象山县", "宁海县",
                                                                                                          "余姚市", "慈溪市",
                                                                                                          "奉化市"]},
                                                 {"name": "温州市",
                                                  "area": ["鹿城区", "龙湾区", "瓯海区", "洞头区", "永嘉县", "平阳县", "苍南县", "文成县",
                                                           "泰顺县", "瑞安市", "乐清市"]}, {"name": "嘉兴市",
                                                                                   "area": ["南湖区", "秀洲区", "嘉善县", "海盐县",
                                                                                            "海宁市", "平湖市", "桐乡市"]},
                                                 {"name": "湖州市", "area": ["吴兴区", "南浔区", "德清县", "长兴县", "安吉县"]},
                                                 {"name": "绍兴市", "area": ["越城区", "柯桥区", "上虞区", "新昌县", "诸暨市", "嵊州市"]},
                                                 {"name": "金华市",
                                                  "area": ["婺城区", "金东区", "武义县", "浦江县", "磐安县", "兰溪市", "义乌市", "东阳市",
                                                           "永康市"]},
                                                 {"name": "衢州市", "area": ["柯城区", "衢江区", "常山县", "开化县", "龙游县", "江山市"]},
                                                 {"name": "舟山市", "area": ["定海区", "普陀区", "岱山县", "嵊泗县"]}, {"name": "台州市",
                                                                                                         "area": ["椒江区",
                                                                                                                  "黄岩区",
                                                                                                                  "路桥区",
                                                                                                                  "玉环县",
                                                                                                                  "三门县",
                                                                                                                  "天台县",
                                                                                                                  "仙居县",
                                                                                                                  "温岭市",
                                                                                                                  "临海市"]},
                                                 {"name": "丽水市",
                                                  "area": ["莲都区", "青田县", "缙云县", "遂昌县", "松阳县", "云和县", "庆元县", "景宁畲族自治县",
                                                           "龙泉市"]}]}, {"name": "安徽省", "city": [
                    {"name": "合肥市", "area": ["瑶海区", "庐阳区", "蜀山区", "包河区", "长丰县", "肥东县", "肥西县", "庐江县", "巢湖市"]},
                    {"name": "芜湖市", "area": ["镜湖区", "弋江区", "鸠江区", "三山区", "芜湖县", "繁昌县", "南陵县", "无为县"]},
                    {"name": "蚌埠市", "area": ["龙子湖区", "蚌山区", "禹会区", "淮上区", "怀远县", "五河县", "固镇县"]},
                    {"name": "淮南市", "area": ["大通区", "田家庵区", "谢家集区", "八公山区", "潘集区", "凤台县", "寿县"]},
                    {"name": "马鞍山市", "area": ["花山区", "雨山区", "博望区", "当涂县", "含山县", "和县"]},
                    {"name": "淮北市", "area": ["杜集区", "相山区", "烈山区", "濉溪县"]},
                    {"name": "铜陵市", "area": ["铜官区", "义安区", "郊区", "枞阳县"]},
                    {"name": "安庆市", "area": ["迎江区", "大观区", "宜秀区", "怀宁县", "潜山县", "太湖县", "宿松县", "望江县", "岳西县", "桐城市"]},
                    {"name": "黄山市", "area": ["屯溪区", "黄山区", "徽州区", "歙县", "休宁县", "黟县", "祁门县"]},
                    {"name": "滁州市", "area": ["琅琊区", "南谯区", "来安县", "全椒县", "定远县", "凤阳县", "天长市", "明光市"]},
                    {"name": "阜阳市", "area": ["颍州区", "颍东区", "颍泉区", "临泉县", "太和县", "阜南县", "颍上县", "界首市"]},
                    {"name": "宿州市", "area": ["埇桥区", "砀山县", "萧县", "灵璧县", "泗县"]},
                    {"name": "六安市", "area": ["金安区", "裕安区", "叶集区", "霍邱县", "舒城县", "金寨县", "霍山县"]},
                    {"name": "亳州市", "area": ["谯城区", "涡阳县", "蒙城县", "利辛县"]},
                    {"name": "池州市", "area": ["贵池区", "东至县", "石台县", "青阳县"]},
                    {"name": "宣城市", "area": ["宣州区", "郎溪县", "广德县", "泾县", "绩溪县", "旌德县", "宁国市"]}]}, {"name": "福建省",
                                                                                                  "city": [
                                                                                                      {"name": "福州市",
                                                                                                       "area": ["鼓楼区",
                                                                                                                "台江区",
                                                                                                                "仓山区",
                                                                                                                "马尾区",
                                                                                                                "晋安区",
                                                                                                                "闽侯县",
                                                                                                                "连江县",
                                                                                                                "罗源县",
                                                                                                                "闽清县",
                                                                                                                "永泰县",
                                                                                                                "平潭县",
                                                                                                                "福清市",
                                                                                                                "长乐市"]},
                                                                                                      {"name": "厦门市",
                                                                                                       "area": ["思明区",
                                                                                                                "海沧区",
                                                                                                                "湖里区",
                                                                                                                "集美区",
                                                                                                                "同安区",
                                                                                                                "翔安区"]},
                                                                                                      {"name": "莆田市",
                                                                                                       "area": ["城厢区",
                                                                                                                "涵江区",
                                                                                                                "荔城区",
                                                                                                                "秀屿区",
                                                                                                                "仙游县"]},
                                                                                                      {"name": "三明市",
                                                                                                       "area": ["梅列区",
                                                                                                                "三元区",
                                                                                                                "明溪县",
                                                                                                                "清流县",
                                                                                                                "宁化县",
                                                                                                                "大田县",
                                                                                                                "尤溪县",
                                                                                                                "沙县",
                                                                                                                "将乐县",
                                                                                                                "泰宁县",
                                                                                                                "建宁县",
                                                                                                                "永安市"]},
                                                                                                      {"name": "泉州市",
                                                                                                       "area": ["鲤城区",
                                                                                                                "丰泽区",
                                                                                                                "洛江区",
                                                                                                                "泉港区",
                                                                                                                "惠安县",
                                                                                                                "安溪县",
                                                                                                                "永春县",
                                                                                                                "德化县",
                                                                                                                "金门县",
                                                                                                                "石狮市",
                                                                                                                "晋江市",
                                                                                                                "南安市"]},
                                                                                                      {"name": "漳州市",
                                                                                                       "area": ["芗城区",
                                                                                                                "龙文区",
                                                                                                                "云霄县",
                                                                                                                "漳浦县",
                                                                                                                "诏安县",
                                                                                                                "长泰县",
                                                                                                                "东山县",
                                                                                                                "南靖县",
                                                                                                                "平和县",
                                                                                                                "华安县",
                                                                                                                "龙海市"]},
                                                                                                      {"name": "南平市",
                                                                                                       "area": ["延平区",
                                                                                                                "建阳区",
                                                                                                                "顺昌县",
                                                                                                                "浦城县",
                                                                                                                "光泽县",
                                                                                                                "松溪县",
                                                                                                                "政和县",
                                                                                                                "邵武市",
                                                                                                                "武夷山市",
                                                                                                                "建瓯市"]},
                                                                                                      {"name": "龙岩市",
                                                                                                       "area": ["新罗区",
                                                                                                                "永定区",
                                                                                                                "长汀县",
                                                                                                                "上杭县",
                                                                                                                "武平县",
                                                                                                                "连城县",
                                                                                                                "漳平市"]},
                                                                                                      {"name": "宁德市",
                                                                                                       "area": ["蕉城区",
                                                                                                                "霞浦县",
                                                                                                                "古田县",
                                                                                                                "屏南县",
                                                                                                                "寿宁县",
                                                                                                                "周宁县",
                                                                                                                "柘荣县",
                                                                                                                "福安市",
                                                                                                                "福鼎市"]}]},
                        {"name": "江西省", "city": [
                            {"name": "南昌市", "area": ["东湖区", "西湖区", "青云谱区", "湾里区", "青山湖区", "新建区", "南昌县", "安义县", "进贤县"]},
                            {"name": "景德镇市", "area": ["昌江区", "珠山区", "浮梁县", "乐平市"]},
                            {"name": "萍乡市", "area": ["安源区", "湘东区", "莲花县", "上栗县", "芦溪县"]}, {"name": "九江市",
                                                                                           "area": ["濂溪区", "浔阳区", "九江县",
                                                                                                    "武宁县", "修水县", "永修县",
                                                                                                    "德安县", "都昌县", "湖口县",
                                                                                                    "彭泽县", "瑞昌市",
                                                                                                    "共青城市", "庐山市"]},
                            {"name": "新余市", "area": ["渝水区", "分宜县"]}, {"name": "鹰潭市", "area": ["月湖区", "余江县", "贵溪市"]},
                            {"name": "赣州市",
                             "area": ["章贡区", "南康区", "赣县", "信丰县", "大余县", "上犹县", "崇义县", "安远县", "龙南县", "定南县", "全南县", "宁都县",
                                      "于都县", "兴国县", "会昌县", "寻乌县", "石城县", "瑞金市"]}, {"name": "吉安市",
                                                                                   "area": ["吉州区", "青原区", "吉安县", "吉水县",
                                                                                            "峡江县", "新干县", "永丰县", "泰和县",
                                                                                            "遂川县", "万安县", "安福县", "永新县",
                                                                                            "井冈山市"]}, {"name": "宜春市",
                                                                                                       "area": ["袁州区",
                                                                                                                "奉新县",
                                                                                                                "万载县",
                                                                                                                "上高县",
                                                                                                                "宜丰县",
                                                                                                                "靖安县",
                                                                                                                "铜鼓县",
                                                                                                                "丰城市",
                                                                                                                "樟树市",
                                                                                                                "高安市"]},
                            {"name": "抚州市",
                             "area": ["临川区", "南城县", "黎川县", "南丰县", "崇仁县", "乐安县", "宜黄县", "金溪县", "资溪县", "东乡县", "广昌县"]},
                            {"name": "上饶市",
                             "area": ["信州区", "广丰区", "上饶县", "玉山县", "铅山县", "横峰县", "弋阳县", "余干县", "鄱阳县", "万年县", "婺源县",
                                      "德兴市"]}]}, {"name": "山东省", "city": [
                    {"name": "济南市", "area": ["历下区", "市中区", "槐荫区", "天桥区", "历城区", "长清区", "平阴县", "济阳县", "商河县", "章丘市"]},
                    {"name": "青岛市", "area": ["市南区", "市北区", "黄岛区", "崂山区", "李沧区", "城阳区", "胶州市", "即墨市", "平度市", "莱西市"]},
                    {"name": "淄博市", "area": ["淄川区", "张店区", "博山区", "临淄区", "周村区", "桓台县", "高青县", "沂源县"]},
                    {"name": "枣庄市", "area": ["市中区", "薛城区", "峄城区", "台儿庄区", "山亭区", "滕州市"]},
                    {"name": "东营市", "area": ["东营区", "河口区", "垦利区", "利津县", "广饶县"]}, {"name": "烟台市",
                                                                                   "area": ["芝罘区", "福山区", "牟平区", "莱山区",
                                                                                            "长岛县", "龙口市", "莱阳市", "莱州市",
                                                                                            "蓬莱市", "招远市", "栖霞市",
                                                                                            "海阳市"]}, {"name": "潍坊市",
                                                                                                      "area": ["潍城区",
                                                                                                               "寒亭区",
                                                                                                               "坊子区",
                                                                                                               "奎文区",
                                                                                                               "临朐县",
                                                                                                               "昌乐县",
                                                                                                               "青州市",
                                                                                                               "诸城市",
                                                                                                               "寿光市",
                                                                                                               "安丘市",
                                                                                                               "高密市",
                                                                                                               "昌邑市"]},
                    {"name": "济宁市",
                     "area": ["任城区", "兖州区", "微山县", "鱼台县", "金乡县", "嘉祥县", "汶上县", "泗水县", "梁山县", "曲阜市", "邹城市"]},
                    {"name": "泰安市", "area": ["泰山区", "岱岳区", "宁阳县", "东平县", "新泰市", "肥城市"]},
                    {"name": "威海市", "area": ["环翠区", "文登区", "荣成市", "乳山市"]},
                    {"name": "日照市", "area": ["东港区", "岚山区", "五莲县", "莒县"]}, {"name": "莱芜市", "area": ["莱城区", "钢城区"]},
                    {"name": "临沂市",
                     "area": ["兰山区", "罗庄区", "河东区", "沂南县", "郯城县", "沂水县", "兰陵县", "费县", "平邑县", "莒南县", "蒙阴县", "临沭县"]},
                    {"name": "德州市",
                     "area": ["德城区", "陵城区", "宁津县", "庆云县", "临邑县", "齐河县", "平原县", "夏津县", "武城县", "乐陵市", "禹城市"]},
                    {"name": "聊城市", "area": ["东昌府区", "阳谷县", "莘县", "茌平县", "东阿县", "冠县", "高唐县", "临清市"]},
                    {"name": "滨州市", "area": ["滨城区", "沾化区", "惠民县", "阳信县", "无棣县", "博兴县", "邹平县"]},
                    {"name": "菏泽市", "area": ["牡丹区", "定陶区", "曹县", "单县", "成武县", "巨野县", "郓城县", "鄄城县", "东明县"]}]},
                        {"name": "河南省", "city": [{"name": "郑州市",
                                                  "area": ["中原区", "二七区", "管城回族区", "金水区", "上街区", "惠济区", "中牟县", "巩义市",
                                                           "荥阳市", "新密市", "新郑市", "登封市"]}, {"name": "开封市",
                                                                                          "area": ["龙亭区", "顺河回族区",
                                                                                                   "鼓楼区", "禹王台区", "金明区",
                                                                                                   "祥符区", "杞县", "通许县",
                                                                                                   "尉氏县", "兰考县"]},
                                                 {"name": "洛阳市",
                                                  "area": ["老城区", "西工区", "瀍河回族区", "涧西区", "吉利区", "洛龙区", "孟津县", "新安县",
                                                           "栾川县", "嵩县", "汝阳县", "宜阳县", "洛宁县", "伊川县", "偃师市"]},
                                                 {"name": "平顶山市",
                                                  "area": ["新华区", "卫东区", "石龙区", "湛河区", "宝丰县", "叶县", "鲁山县", "郏县", "舞钢市",
                                                           "汝州市"]}, {"name": "安阳市",
                                                                     "area": ["文峰区", "北关区", "殷都区", "龙安区", "安阳县", "汤阴县",
                                                                              "滑县", "内黄县", "林州市"]},
                                                 {"name": "鹤壁市", "area": ["鹤山区", "山城区", "淇滨区", "浚县", "淇县"]},
                                                 {"name": "新乡市",
                                                  "area": ["红旗区", "卫滨区", "凤泉区", "牧野区", "新乡县", "获嘉县", "原阳县", "延津县",
                                                           "封丘县", "长垣县", "卫辉市", "辉县市"]}, {"name": "焦作市",
                                                                                          "area": ["解放区", "中站区", "马村区",
                                                                                                   "山阳区", "修武县", "博爱县",
                                                                                                   "武陟县", "温县", "沁阳市",
                                                                                                   "孟州市"]},
                                                 {"name": "濮阳市", "area": ["华龙区", "清丰县", "南乐县", "范县", "台前县", "濮阳县"]},
                                                 {"name": "许昌市", "area": ["魏都区", "许昌县", "鄢陵县", "襄城县", "禹州市", "长葛市"]},
                                                 {"name": "漯河市", "area": ["源汇区", "郾城区", "召陵区", "舞阳县", "临颍县"]},
                                                 {"name": "三门峡市", "area": ["湖滨区", "陕州区", "渑池县", "卢氏县", "义马市", "灵宝市"]},
                                                 {"name": "南阳市",
                                                  "area": ["宛城区", "卧龙区", "南召县", "方城县", "西峡县", "镇平县", "内乡县", "淅川县",
                                                           "社旗县", "唐河县", "新野县", "桐柏县", "邓州市"]}, {"name": "商丘市",
                                                                                                 "area": ["梁园区", "睢阳区",
                                                                                                          "民权县", "睢县",
                                                                                                          "宁陵县", "柘城县",
                                                                                                          "虞城县", "夏邑县",
                                                                                                          "永城市"]},
                                                 {"name": "信阳市",
                                                  "area": ["浉河区", "平桥区", "罗山县", "光山县", "新县", "商城县", "固始县", "潢川县", "淮滨县",
                                                           "息县"]}, {"name": "周口市",
                                                                    "area": ["川汇区", "扶沟县", "西华县", "商水县", "沈丘县", "郸城县",
                                                                             "淮阳县", "太康县", "鹿邑县", "项城市"]},
                                                 {"name": "驻马店市",
                                                  "area": ["驿城区", "西平县", "上蔡县", "平舆县", "正阳县", "确山县", "泌阳县", "汝南县",
                                                           "遂平县", "新蔡县"]}, {"name": "省直辖县级行政区划", "area": ["济源市"]}]},
                        {"name": "湖北省", "city": [{"name": "武汉市",
                                                  "area": ["江岸区", "江汉区", "硚口区", "汉阳区", "武昌区", "青山区", "洪山区", "东西湖区",
                                                           "汉南区", "蔡甸区", "江夏区", "黄陂区", "新洲区"]},
                                                 {"name": "黄石市", "area": ["黄石港区", "西塞山区", "下陆区", "铁山区", "阳新县", "大冶市"]},
                                                 {"name": "十堰市",
                                                  "area": ["茅箭区", "张湾区", "郧阳区", "郧西县", "竹山县", "竹溪县", "房县", "丹江口市"]},
                                                 {"name": "宜昌市",
                                                  "area": ["西陵区", "伍家岗区", "点军区", "猇亭区", "夷陵区", "远安县", "兴山县", "秭归县",
                                                           "长阳土家族自治县", "五峰土家族自治县", "宜都市", "当阳市", "枝江市"]},
                                                 {"name": "襄阳市",
                                                  "area": ["襄城区", "樊城区", "襄州区", "南漳县", "谷城县", "保康县", "老河口市", "枣阳市",
                                                           "宜城市"]}, {"name": "鄂州市", "area": ["梁子湖区", "华容区", "鄂城区"]},
                                                 {"name": "荆门市", "area": ["东宝区", "掇刀区", "京山县", "沙洋县", "钟祥市"]},
                                                 {"name": "孝感市",
                                                  "area": ["孝南区", "孝昌县", "大悟县", "云梦县", "应城市", "安陆市", "汉川市"]},
                                                 {"name": "荆州市",
                                                  "area": ["沙市区", "荆州区", "公安县", "监利县", "江陵县", "石首市", "洪湖市", "松滋市"]},
                                                 {"name": "黄冈市",
                                                  "area": ["黄州区", "团风县", "红安县", "罗田县", "英山县", "浠水县", "蕲春县", "黄梅县",
                                                           "麻城市", "武穴市"]},
                                                 {"name": "咸宁市", "area": ["咸安区", "嘉鱼县", "通城县", "崇阳县", "通山县", "赤壁市"]},
                                                 {"name": "随州市", "area": ["曾都区", "随县", "广水市"]}, {"name": "恩施土家族苗族自治州",
                                                                                                 "area": ["恩施市", "利川市",
                                                                                                          "建始县", "巴东县",
                                                                                                          "宣恩县", "咸丰县",
                                                                                                          "来凤县",
                                                                                                          "鹤峰县"]},
                                                 {"name": "省直辖县级行政区划", "area": ["仙桃市", "潜江市", "天门市", "神农架林区"]}]},
                        {"name": "湖南省", "city": [
                            {"name": "长沙市", "area": ["芙蓉区", "天心区", "岳麓区", "开福区", "雨花区", "望城区", "长沙县", "宁乡县", "浏阳市"]},
                            {"name": "株洲市", "area": ["荷塘区", "芦淞区", "石峰区", "天元区", "株洲县", "攸县", "茶陵县", "炎陵县", "醴陵市"]},
                            {"name": "湘潭市", "area": ["雨湖区", "岳塘区", "湘潭县", "湘乡市", "韶山市"]}, {"name": "衡阳市",
                                                                                           "area": ["珠晖区", "雁峰区", "石鼓区",
                                                                                                    "蒸湘区", "南岳区", "衡阳县",
                                                                                                    "衡南县", "衡山县", "衡东县",
                                                                                                    "祁东县", "耒阳市",
                                                                                                    "常宁市"]},
                            {"name": "邵阳市",
                             "area": ["双清区", "大祥区", "北塔区", "邵东县", "新邵县", "邵阳县", "隆回县", "洞口县", "绥宁县", "新宁县", "城步苗族自治县",
                                      "武冈市"]},
                            {"name": "岳阳市", "area": ["岳阳楼区", "云溪区", "君山区", "岳阳县", "华容县", "湘阴县", "平江县", "汨罗市", "临湘市"]},
                            {"name": "常德市", "area": ["武陵区", "鼎城区", "安乡县", "汉寿县", "澧县", "临澧县", "桃源县", "石门县", "津市市"]},
                            {"name": "张家界市", "area": ["永定区", "武陵源区", "慈利县", "桑植县"]},
                            {"name": "益阳市", "area": ["资阳区", "赫山区", "南县", "桃江县", "安化县", "沅江市"]}, {"name": "郴州市",
                                                                                                 "area": ["北湖区", "苏仙区",
                                                                                                          "桂阳县", "宜章县",
                                                                                                          "永兴县", "嘉禾县",
                                                                                                          "临武县", "汝城县",
                                                                                                          "桂东县", "安仁县",
                                                                                                          "资兴市"]},
                            {"name": "永州市",
                             "area": ["零陵区", "冷水滩区", "祁阳县", "东安县", "双牌县", "道县", "江永县", "宁远县", "蓝山县", "新田县", "江华瑶族自治县"]},
                            {"name": "怀化市",
                             "area": ["鹤城区", "中方县", "沅陵县", "辰溪县", "溆浦县", "会同县", "麻阳苗族自治县", "新晃侗族自治县", "芷江侗族自治县",
                                      "靖州苗族侗族自治县", "通道侗族自治县", "洪江市"]},
                            {"name": "娄底市", "area": ["娄星区", "双峰县", "新化县", "冷水江市", "涟源市"]},
                            {"name": "湘西土家族苗族自治州", "area": ["吉首市", "泸溪县", "凤凰县", "花垣县", "保靖县", "古丈县", "永顺县", "龙山县"]}]},
                        {"name": "广东省", "city": [{"name": "广州市",
                                                  "area": ["荔湾区", "越秀区", "海珠区", "天河区", "白云区", "黄埔区", "番禺区", "花都区",
                                                           "南沙区", "从化区", "增城区"]}, {"name": "韶关市",
                                                                                   "area": ["武江区", "浈江区", "曲江区", "始兴县",
                                                                                            "仁化县", "翁源县", "乳源瑶族自治县",
                                                                                            "新丰县", "乐昌市", "南雄市"]},
                                                 {"name": "深圳市", "area": ["罗湖区", "福田区", "南山区", "宝安区", "龙岗区", "盐田区"]},
                                                 {"name": "珠海市", "area": ["香洲区", "斗门区", "金湾区"]}, {"name": "汕头市",
                                                                                                  "area": ["龙湖区", "金平区",
                                                                                                           "濠江区", "潮阳区",
                                                                                                           "潮南区", "澄海区",
                                                                                                           "南澳县"]},
                                                 {"name": "佛山市", "area": ["禅城区", "南海区", "顺德区", "三水区", "高明区"]},
                                                 {"name": "江门市",
                                                  "area": ["蓬江区", "江海区", "新会区", "台山市", "开平市", "鹤山市", "恩平市"]},
                                                 {"name": "湛江市",
                                                  "area": ["赤坎区", "霞山区", "坡头区", "麻章区", "遂溪县", "徐闻县", "廉江市", "雷州市",
                                                           "吴川市"]},
                                                 {"name": "茂名市", "area": ["茂南区", "电白区", "高州市", "化州市", "信宜市"]},
                                                 {"name": "肇庆市",
                                                  "area": ["端州区", "鼎湖区", "高要区", "广宁县", "怀集县", "封开县", "德庆县", "四会市"]},
                                                 {"name": "惠州市", "area": ["惠城区", "惠阳区", "博罗县", "惠东县", "龙门县"]},
                                                 {"name": "梅州市",
                                                  "area": ["梅江区", "梅县区", "大埔县", "丰顺县", "五华县", "平远县", "蕉岭县", "兴宁市"]},
                                                 {"name": "汕尾市", "area": ["城区", "海丰县", "陆河县", "陆丰市"]},
                                                 {"name": "河源市", "area": ["源城区", "紫金县", "龙川县", "连平县", "和平县", "东源县"]},
                                                 {"name": "阳江市", "area": ["江城区", "阳东区", "阳西县", "阳春市"]}, {"name": "清远市",
                                                                                                         "area": ["清城区",
                                                                                                                  "清新区",
                                                                                                                  "佛冈县",
                                                                                                                  "阳山县",
                                                                                                                  "连山壮族瑶族自治县",
                                                                                                                  "连南瑶族自治县",
                                                                                                                  "英德市",
                                                                                                                  "连州市"]},
                                                 {"name": "东莞市", "area": []}, {"name": "中山市", "area": []},
                                                 {"name": "潮州市", "area": ["湘桥区", "潮安区", "饶平县"]},
                                                 {"name": "揭阳市", "area": ["榕城区", "揭东区", "揭西县", "惠来县", "普宁市"]},
                                                 {"name": "云浮市", "area": ["云城区", "云安区", "新兴县", "郁南县", "罗定市"]}]},
                        {"name": "广西壮族自治区", "city": [{"name": "南宁市",
                                                      "area": ["兴宁区", "青秀区", "江南区", "西乡塘区", "良庆区", "邕宁区", "武鸣区", "隆安县",
                                                               "马山县", "上林县", "宾阳县", "横县"]}, {"name": "柳州市",
                                                                                             "area": ["城中区", "鱼峰区",
                                                                                                      "柳南区", "柳北区",
                                                                                                      "柳江区", "柳城县",
                                                                                                      "鹿寨县", "融安县",
                                                                                                      "融水苗族自治县",
                                                                                                      "三江侗族自治县"]},
                                                     {"name": "桂林市",
                                                      "area": ["秀峰区", "叠彩区", "象山区", "七星区", "雁山区", "临桂区", "阳朔县", "灵川县",
                                                               "全州县", "兴安县", "永福县", "灌阳县", "龙胜各族自治县", "资源县", "平乐县",
                                                               "荔浦县", "恭城瑶族自治县"]}, {"name": "梧州市",
                                                                                    "area": ["万秀区", "长洲区", "龙圩区", "苍梧县",
                                                                                             "藤县", "蒙山县", "岑溪市"]},
                                                     {"name": "北海市", "area": ["海城区", "银海区", "铁山港区", "合浦县"]},
                                                     {"name": "防城港市", "area": ["港口区", "防城区", "上思县", "东兴市"]},
                                                     {"name": "钦州市", "area": ["钦南区", "钦北区", "灵山县", "浦北县"]},
                                                     {"name": "贵港市", "area": ["港北区", "港南区", "覃塘区", "平南县", "桂平市"]},
                                                     {"name": "玉林市",
                                                      "area": ["玉州区", "福绵区", "容县", "陆川县", "博白县", "兴业县", "北流市"]},
                                                     {"name": "百色市",
                                                      "area": ["右江区", "田阳县", "田东县", "平果县", "德保县", "那坡县", "凌云县", "乐业县",
                                                               "田林县", "西林县", "隆林各族自治县", "靖西市"]},
                                                     {"name": "贺州市", "area": ["八步区", "平桂区", "昭平县", "钟山县", "富川瑶族自治县"]},
                                                     {"name": "河池市",
                                                      "area": ["金城江区", "南丹县", "天峨县", "凤山县", "东兰县", "罗城仫佬族自治县",
                                                               "环江毛南族自治县", "巴马瑶族自治县", "都安瑶族自治县", "大化瑶族自治县", "宜州市"]},
                                                     {"name": "来宾市",
                                                      "area": ["兴宾区", "忻城县", "象州县", "武宣县", "金秀瑶族自治县", "合山市"]},
                                                     {"name": "崇左市",
                                                      "area": ["江州区", "扶绥县", "宁明县", "龙州县", "大新县", "天等县", "凭祥市"]}]},
                        {"name": "海南省", "city": [{"name": "海口市", "area": ["秀英区", "龙华区", "琼山区", "美兰区"]},
                                                 {"name": "三亚市", "area": ["海棠区", "吉阳区", "天涯区", "崖州区"]},
                                                 {"name": "三沙市", "area": []}, {"name": "儋州市", "area": []},
                                                 {"name": "省直辖县级行政区划",
                                                  "area": ["五指山市", "琼海市", "文昌市", "万宁市", "东方市", "定安县", "屯昌县", "澄迈县",
                                                           "临高县", "白沙黎族自治县", "昌江黎族自治县", "乐东黎族自治县", "陵水黎族自治县",
                                                           "保亭黎族苗族自治县", "琼中黎族苗族自治县"]}]}, {"name": "重庆市", "city": [
                    {"name": "重庆市",
                     "area": ["万州区", "涪陵区", "渝中区", "大渡口区", "江北区", "沙坪坝区", "九龙坡区", "南岸区", "北碚区", "綦江区", "大足区", "渝北区",
                              "巴南区", "黔江区", "长寿区", "江津区", "合川区", "永川区", "南川区", "璧山区", "铜梁区", "潼南区", "荣昌区", "开州区"]},
                    {"name": "县",
                     "area": ["梁平县", "城口县", "丰都县", "垫江县", "武隆县", "忠县", "云阳县", "奉节县", "巫山县", "巫溪县", "石柱土家族自治县",
                              "秀山土家族苗族自治县", "酉阳土家族苗族自治县", "彭水苗族土家族自治县"]}]}, {"name": "四川省", "city": [{"name": "成都市",
                                                                                                      "area": ["锦江区",
                                                                                                               "青羊区",
                                                                                                               "金牛区",
                                                                                                               "武侯区",
                                                                                                               "成华区",
                                                                                                               "龙泉驿区",
                                                                                                               "青白江区",
                                                                                                               "新都区",
                                                                                                               "温江区",
                                                                                                               "双流区",
                                                                                                               "金堂县",
                                                                                                               "郫县",
                                                                                                               "大邑县",
                                                                                                               "蒲江县",
                                                                                                               "新津县",
                                                                                                               "都江堰市",
                                                                                                               "彭州市",
                                                                                                               "邛崃市",
                                                                                                               "崇州市",
                                                                                                               "简阳市"]},
                                                                                                     {"name": "自贡市",
                                                                                                      "area": ["自流井区",
                                                                                                               "贡井区",
                                                                                                               "大安区",
                                                                                                               "沿滩区",
                                                                                                               "荣县",
                                                                                                               "富顺县"]},
                                                                                                     {"name": "攀枝花市",
                                                                                                      "area": ["东区",
                                                                                                               "西区",
                                                                                                               "仁和区",
                                                                                                               "米易县",
                                                                                                               "盐边县"]},
                                                                                                     {"name": "泸州市",
                                                                                                      "area": ["江阳区",
                                                                                                               "纳溪区",
                                                                                                               "龙马潭区",
                                                                                                               "泸县",
                                                                                                               "合江县",
                                                                                                               "叙永县",
                                                                                                               "古蔺县"]},
                                                                                                     {"name": "德阳市",
                                                                                                      "area": ["旌阳区",
                                                                                                               "中江县",
                                                                                                               "罗江县",
                                                                                                               "广汉市",
                                                                                                               "什邡市",
                                                                                                               "绵竹市"]},
                                                                                                     {"name": "绵阳市",
                                                                                                      "area": ["涪城区",
                                                                                                               "游仙区",
                                                                                                               "安州区",
                                                                                                               "三台县",
                                                                                                               "盐亭县",
                                                                                                               "梓潼县",
                                                                                                               "北川羌族自治县",
                                                                                                               "平武县",
                                                                                                               "江油市"]},
                                                                                                     {"name": "广元市",
                                                                                                      "area": ["利州区",
                                                                                                               "昭化区",
                                                                                                               "朝天区",
                                                                                                               "旺苍县",
                                                                                                               "青川县",
                                                                                                               "剑阁县",
                                                                                                               "苍溪县"]},
                                                                                                     {"name": "遂宁市",
                                                                                                      "area": ["船山区",
                                                                                                               "安居区",
                                                                                                               "蓬溪县",
                                                                                                               "射洪县",
                                                                                                               "大英县"]},
                                                                                                     {"name": "内江市",
                                                                                                      "area": ["市中区",
                                                                                                               "东兴区",
                                                                                                               "威远县",
                                                                                                               "资中县",
                                                                                                               "隆昌县"]},
                                                                                                     {"name": "乐山市",
                                                                                                      "area": ["市中区",
                                                                                                               "沙湾区",
                                                                                                               "五通桥区",
                                                                                                               "金口河区",
                                                                                                               "犍为县",
                                                                                                               "井研县",
                                                                                                               "夹江县",
                                                                                                               "沐川县",
                                                                                                               "峨边彝族自治县",
                                                                                                               "马边彝族自治县",
                                                                                                               "峨眉山市"]},
                                                                                                     {"name": "南充市",
                                                                                                      "area": ["顺庆区",
                                                                                                               "高坪区",
                                                                                                               "嘉陵区",
                                                                                                               "南部县",
                                                                                                               "营山县",
                                                                                                               "蓬安县",
                                                                                                               "仪陇县",
                                                                                                               "西充县",
                                                                                                               "阆中市"]},
                                                                                                     {"name": "眉山市",
                                                                                                      "area": ["东坡区",
                                                                                                               "彭山区",
                                                                                                               "仁寿县",
                                                                                                               "洪雅县",
                                                                                                               "丹棱县",
                                                                                                               "青神县"]},
                                                                                                     {"name": "宜宾市",
                                                                                                      "area": ["翠屏区",
                                                                                                               "南溪区",
                                                                                                               "宜宾县",
                                                                                                               "江安县",
                                                                                                               "长宁县",
                                                                                                               "高县",
                                                                                                               "珙县",
                                                                                                               "筠连县",
                                                                                                               "兴文县",
                                                                                                               "屏山县"]},
                                                                                                     {"name": "广安市",
                                                                                                      "area": ["广安区",
                                                                                                               "前锋区",
                                                                                                               "岳池县",
                                                                                                               "武胜县",
                                                                                                               "邻水县",
                                                                                                               "华蓥市"]},
                                                                                                     {"name": "达州市",
                                                                                                      "area": ["通川区",
                                                                                                               "达川区",
                                                                                                               "宣汉县",
                                                                                                               "开江县",
                                                                                                               "大竹县",
                                                                                                               "渠县",
                                                                                                               "万源市"]},
                                                                                                     {"name": "雅安市",
                                                                                                      "area": ["雨城区",
                                                                                                               "名山区",
                                                                                                               "荥经县",
                                                                                                               "汉源县",
                                                                                                               "石棉县",
                                                                                                               "天全县",
                                                                                                               "芦山县",
                                                                                                               "宝兴县"]},
                                                                                                     {"name": "巴中市",
                                                                                                      "area": ["巴州区",
                                                                                                               "恩阳区",
                                                                                                               "通江县",
                                                                                                               "南江县",
                                                                                                               "平昌县"]},
                                                                                                     {"name": "资阳市",
                                                                                                      "area": ["雁江区",
                                                                                                               "安岳县",
                                                                                                               "乐至县"]},
                                                                                                     {
                                                                                                         "name": "阿坝藏族羌族自治州",
                                                                                                         "area": [
                                                                                                             "马尔康市",
                                                                                                             "汶川县",
                                                                                                             "理县", "茂县",
                                                                                                             "松潘县",
                                                                                                             "九寨沟县",
                                                                                                             "金川县",
                                                                                                             "小金县",
                                                                                                             "黑水县",
                                                                                                             "壤塘县",
                                                                                                             "阿坝县",
                                                                                                             "若尔盖县",
                                                                                                             "红原县"]},
                                                                                                     {"name": "甘孜藏族自治州",
                                                                                                      "area": ["康定市",
                                                                                                               "泸定县",
                                                                                                               "丹巴县",
                                                                                                               "九龙县",
                                                                                                               "雅江县",
                                                                                                               "道孚县",
                                                                                                               "炉霍县",
                                                                                                               "甘孜县",
                                                                                                               "新龙县",
                                                                                                               "德格县",
                                                                                                               "白玉县",
                                                                                                               "石渠县",
                                                                                                               "色达县",
                                                                                                               "理塘县",
                                                                                                               "巴塘县",
                                                                                                               "乡城县",
                                                                                                               "稻城县",
                                                                                                               "得荣县"]},
                                                                                                     {"name": "凉山彝族自治州",
                                                                                                      "area": ["西昌市",
                                                                                                               "木里藏族自治县",
                                                                                                               "盐源县",
                                                                                                               "德昌县",
                                                                                                               "会理县",
                                                                                                               "会东县",
                                                                                                               "宁南县",
                                                                                                               "普格县",
                                                                                                               "布拖县",
                                                                                                               "金阳县",
                                                                                                               "昭觉县",
                                                                                                               "喜德县",
                                                                                                               "冕宁县",
                                                                                                               "越西县",
                                                                                                               "甘洛县",
                                                                                                               "美姑县",
                                                                                                               "雷波县"]}]},
                        {"name": "贵州省", "city": [{"name": "贵阳市",
                                                  "area": ["南明区", "云岩区", "花溪区", "乌当区", "白云区", "观山湖区", "开阳县", "息烽县",
                                                           "修文县", "清镇市"]},
                                                 {"name": "六盘水市", "area": ["钟山区", "六枝特区", "水城县", "盘县"]}, {"name": "遵义市",
                                                                                                          "area": [
                                                                                                              "红花岗区",
                                                                                                              "汇川区",
                                                                                                              "播州区",
                                                                                                              "桐梓县",
                                                                                                              "绥阳县",
                                                                                                              "正安县",
                                                                                                              "道真仡佬族苗族自治县",
                                                                                                              "务川仡佬族苗族自治县",
                                                                                                              "凤冈县",
                                                                                                              "湄潭县",
                                                                                                              "余庆县",
                                                                                                              "习水县",
                                                                                                              "赤水市",
                                                                                                              "仁怀市"]},
                                                 {"name": "安顺市",
                                                  "area": ["西秀区", "平坝区", "普定县", "镇宁布依族苗族自治县", "关岭布依族苗族自治县",
                                                           "紫云苗族布依族自治县"]}, {"name": "毕节市",
                                                                            "area": ["七星关区", "大方县", "黔西县", "金沙县", "织金县",
                                                                                     "纳雍县", "威宁彝族回族苗族自治县", "赫章县"]},
                                                 {"name": "铜仁市",
                                                  "area": ["碧江区", "万山区", "江口县", "玉屏侗族自治县", "石阡县", "思南县", "印江土家族苗族自治县",
                                                           "德江县", "沿河土家族自治县", "松桃苗族自治县"]}, {"name": "黔西南布依族苗族自治州",
                                                                                            "area": ["兴义市", "兴仁县",
                                                                                                     "普安县", "晴隆县",
                                                                                                     "贞丰县", "望谟县",
                                                                                                     "册亨县", "安龙县"]},
                                                 {"name": "黔东南苗族侗族自治州",
                                                  "area": ["凯里市", "黄平县", "施秉县", "三穗县", "镇远县", "岑巩县", "天柱县", "锦屏县",
                                                           "剑河县", "台江县", "黎平县", "榕江县", "从江县", "雷山县", "麻江县", "丹寨县"]},
                                                 {"name": "黔南布依族苗族自治州",
                                                  "area": ["都匀市", "福泉市", "荔波县", "贵定县", "瓮安县", "独山县", "平塘县", "罗甸县",
                                                           "长顺县", "龙里县", "惠水县", "三都水族自治县"]}]}, {"name": "云南省", "city": [
                    {"name": "昆明市",
                     "area": ["五华区", "盘龙区", "官渡区", "西山区", "东川区", "呈贡区", "晋宁县", "富民县", "宜良县", "石林彝族自治县", "嵩明县",
                              "禄劝彝族苗族自治县", "寻甸回族彝族自治县", "安宁市"]},
                    {"name": "曲靖市", "area": ["麒麟区", "沾益区", "马龙县", "陆良县", "师宗县", "罗平县", "富源县", "会泽县", "宣威市"]},
                    {"name": "玉溪市",
                     "area": ["红塔区", "江川区", "澄江县", "通海县", "华宁县", "易门县", "峨山彝族自治县", "新平彝族傣族自治县", "元江哈尼族彝族傣族自治县"]},
                    {"name": "保山市", "area": ["隆阳区", "施甸县", "龙陵县", "昌宁县", "腾冲市"]}, {"name": "昭通市",
                                                                                   "area": ["昭阳区", "鲁甸县", "巧家县", "盐津县",
                                                                                            "大关县", "永善县", "绥江县", "镇雄县",
                                                                                            "彝良县", "威信县", "水富县"]},
                    {"name": "丽江市", "area": ["古城区", "玉龙纳西族自治县", "永胜县", "华坪县", "宁蒗彝族自治县"]}, {"name": "普洱市",
                                                                                            "area": ["思茅区",
                                                                                                     "宁洱哈尼族彝族自治县",
                                                                                                     "墨江哈尼族自治县",
                                                                                                     "景东彝族自治县",
                                                                                                     "景谷傣族彝族自治县",
                                                                                                     "镇沅彝族哈尼族拉祜族自治县",
                                                                                                     "江城哈尼族彝族自治县",
                                                                                                     "孟连傣族拉祜族佤族自治县",
                                                                                                     "澜沧拉祜族自治县",
                                                                                                     "西盟佤族自治县"]},
                    {"name": "临沧市",
                     "area": ["临翔区", "凤庆县", "云县", "永德县", "镇康县", "双江拉祜族佤族布朗族傣族自治县", "耿马傣族佤族自治县", "沧源佤族自治县"]},
                    {"name": "楚雄彝族自治州", "area": ["楚雄市", "双柏县", "牟定县", "南华县", "姚安县", "大姚县", "永仁县", "元谋县", "武定县", "禄丰县"]},
                    {"name": "红河哈尼族彝族自治州",
                     "area": ["个旧市", "开远市", "蒙自市", "弥勒市", "屏边苗族自治县", "建水县", "石屏县", "泸西县", "元阳县", "红河县", "金平苗族瑶族傣族自治县",
                              "绿春县", "河口瑶族自治县"]},
                    {"name": "文山壮族苗族自治州", "area": ["文山市", "砚山县", "西畴县", "麻栗坡县", "马关县", "丘北县", "广南县", "富宁县"]},
                    {"name": "西双版纳傣族自治州", "area": ["景洪市", "勐海县", "勐腊县"]}, {"name": "大理白族自治州",
                                                                           "area": ["大理市", "漾濞彝族自治县", "祥云县", "宾川县",
                                                                                    "弥渡县", "南涧彝族自治县", "巍山彝族回族自治县",
                                                                                    "永平县", "云龙县", "洱源县", "剑川县", "鹤庆县"]},
                    {"name": "德宏傣族景颇族自治州", "area": ["瑞丽市", "芒市", "梁河县", "盈江县", "陇川县"]},
                    {"name": "怒江傈僳族自治州", "area": ["泸水市", "福贡县", "贡山独龙族怒族自治县", "兰坪白族普米族自治县"]},
                    {"name": "迪庆藏族自治州", "area": ["香格里拉市", "德钦县", "维西傈僳族自治县"]}]}, {"name": "西藏自治区", "city": [
                    {"name": "拉萨市", "area": ["城关区", "堆龙德庆区", "林周县", "当雄县", "尼木县", "曲水县", "达孜县", "墨竹工卡县"]},
                    {"name": "日喀则市",
                     "area": ["桑珠孜区", "南木林县", "江孜县", "定日县", "萨迦县", "拉孜县", "昂仁县", "谢通门县", "白朗县", "仁布县", "康马县", "定结县",
                              "仲巴县", "亚东县", "吉隆县", "聂拉木县", "萨嘎县", "岗巴县"]}, {"name": "昌都市",
                                                                            "area": ["卡若区", "江达县", "贡觉县", "类乌齐县", "丁青县",
                                                                                     "察雅县", "八宿县", "左贡县", "芒康县", "洛隆县",
                                                                                     "边坝县"]},
                    {"name": "林芝市", "area": ["巴宜区", "工布江达县", "米林县", "墨脱县", "波密县", "察隅县", "朗县"]}, {"name": "山南市",
                                                                                                  "area": ["乃东区", "扎囊县",
                                                                                                           "贡嘎县", "桑日县",
                                                                                                           "琼结县", "曲松县",
                                                                                                           "措美县", "洛扎县",
                                                                                                           "加查县", "隆子县",
                                                                                                           "错那县",
                                                                                                           "浪卡子县"]},
                    {"name": "那曲地区",
                     "area": ["那曲县", "嘉黎县", "比如县", "聂荣县", "安多县", "申扎县", "索县", "班戈县", "巴青县", "尼玛县", "双湖县"]},
                    {"name": "阿里地区", "area": ["普兰县", "札达县", "噶尔县", "日土县", "革吉县", "改则县", "措勤县"]}]}, {"name": "陕西省",
                                                                                                    "city": [
                                                                                                        {"name": "西安市",
                                                                                                         "area": ["新城区",
                                                                                                                  "碑林区",
                                                                                                                  "莲湖区",
                                                                                                                  "灞桥区",
                                                                                                                  "未央区",
                                                                                                                  "雁塔区",
                                                                                                                  "阎良区",
                                                                                                                  "临潼区",
                                                                                                                  "长安区",
                                                                                                                  "高陵区",
                                                                                                                  "蓝田县",
                                                                                                                  "周至县",
                                                                                                                  "户县"]},
                                                                                                        {"name": "铜川市",
                                                                                                         "area": ["王益区",
                                                                                                                  "印台区",
                                                                                                                  "耀州区",
                                                                                                                  "宜君县"]},
                                                                                                        {"name": "宝鸡市",
                                                                                                         "area": ["渭滨区",
                                                                                                                  "金台区",
                                                                                                                  "陈仓区",
                                                                                                                  "凤翔县",
                                                                                                                  "岐山县",
                                                                                                                  "扶风县",
                                                                                                                  "眉县",
                                                                                                                  "陇县",
                                                                                                                  "千阳县",
                                                                                                                  "麟游县",
                                                                                                                  "凤县",
                                                                                                                  "太白县"]},
                                                                                                        {"name": "咸阳市",
                                                                                                         "area": ["秦都区",
                                                                                                                  "杨陵区",
                                                                                                                  "渭城区",
                                                                                                                  "三原县",
                                                                                                                  "泾阳县",
                                                                                                                  "乾县",
                                                                                                                  "礼泉县",
                                                                                                                  "永寿县",
                                                                                                                  "彬县",
                                                                                                                  "长武县",
                                                                                                                  "旬邑县",
                                                                                                                  "淳化县",
                                                                                                                  "武功县",
                                                                                                                  "兴平市"]},
                                                                                                        {"name": "渭南市",
                                                                                                         "area": ["临渭区",
                                                                                                                  "华州区",
                                                                                                                  "潼关县",
                                                                                                                  "大荔县",
                                                                                                                  "合阳县",
                                                                                                                  "澄城县",
                                                                                                                  "蒲城县",
                                                                                                                  "白水县",
                                                                                                                  "富平县",
                                                                                                                  "韩城市",
                                                                                                                  "华阴市"]},
                                                                                                        {"name": "延安市",
                                                                                                         "area": ["宝塔区",
                                                                                                                  "安塞区",
                                                                                                                  "延长县",
                                                                                                                  "延川县",
                                                                                                                  "子长县",
                                                                                                                  "志丹县",
                                                                                                                  "吴起县",
                                                                                                                  "甘泉县",
                                                                                                                  "富县",
                                                                                                                  "洛川县",
                                                                                                                  "宜川县",
                                                                                                                  "黄龙县",
                                                                                                                  "黄陵县"]},
                                                                                                        {"name": "汉中市",
                                                                                                         "area": ["汉台区",
                                                                                                                  "南郑县",
                                                                                                                  "城固县",
                                                                                                                  "洋县",
                                                                                                                  "西乡县",
                                                                                                                  "勉县",
                                                                                                                  "宁强县",
                                                                                                                  "略阳县",
                                                                                                                  "镇巴县",
                                                                                                                  "留坝县",
                                                                                                                  "佛坪县"]},
                                                                                                        {"name": "榆林市",
                                                                                                         "area": ["榆阳区",
                                                                                                                  "横山区",
                                                                                                                  "神木县",
                                                                                                                  "府谷县",
                                                                                                                  "靖边县",
                                                                                                                  "定边县",
                                                                                                                  "绥德县",
                                                                                                                  "米脂县",
                                                                                                                  "佳县",
                                                                                                                  "吴堡县",
                                                                                                                  "清涧县",
                                                                                                                  "子洲县"]},
                                                                                                        {"name": "安康市",
                                                                                                         "area": ["汉滨区",
                                                                                                                  "汉阴县",
                                                                                                                  "石泉县",
                                                                                                                  "宁陕县",
                                                                                                                  "紫阳县",
                                                                                                                  "岚皋县",
                                                                                                                  "平利县",
                                                                                                                  "镇坪县",
                                                                                                                  "旬阳县",
                                                                                                                  "白河县"]},
                                                                                                        {"name": "商洛市",
                                                                                                         "area": ["商州区",
                                                                                                                  "洛南县",
                                                                                                                  "丹凤县",
                                                                                                                  "商南县",
                                                                                                                  "山阳县",
                                                                                                                  "镇安县",
                                                                                                                  "柞水县"]}]},
                        {"name": "甘肃省",
                         "city": [{"name": "兰州市", "area": ["城关区", "七里河区", "西固区", "安宁区", "红古区", "永登县", "皋兰县", "榆中县"]},
                                  {"name": "嘉峪关市", "area": []}, {"name": "金昌市", "area": ["金川区", "永昌县"]},
                                  {"name": "白银市", "area": ["白银区", "平川区", "靖远县", "会宁县", "景泰县"]},
                                  {"name": "天水市", "area": ["秦州区", "麦积区", "清水县", "秦安县", "甘谷县", "武山县", "张家川回族自治县"]},
                                  {"name": "武威市", "area": ["凉州区", "民勤县", "古浪县", "天祝藏族自治县"]},
                                  {"name": "张掖市", "area": ["甘州区", "肃南裕固族自治县", "民乐县", "临泽县", "高台县", "山丹县"]},
                                  {"name": "平凉市", "area": ["崆峒区", "泾川县", "灵台县", "崇信县", "华亭县", "庄浪县", "静宁县"]},
                                  {"name": "酒泉市",
                                   "area": ["肃州区", "金塔县", "瓜州县", "肃北蒙古族自治县", "阿克塞哈萨克族自治县", "玉门市", "敦煌市"]},
                                  {"name": "庆阳市", "area": ["西峰区", "庆城县", "环县", "华池县", "合水县", "正宁县", "宁县", "镇原县"]},
                                  {"name": "定西市", "area": ["安定区", "通渭县", "陇西县", "渭源县", "临洮县", "漳县", "岷县"]},
                                  {"name": "陇南市", "area": ["武都区", "成县", "文县", "宕昌县", "康县", "西和县", "礼县", "徽县", "两当县"]},
                                  {"name": "临夏回族自治州",
                                   "area": ["临夏市", "临夏县", "康乐县", "永靖县", "广河县", "和政县", "东乡族自治县", "积石山保安族东乡族撒拉族自治县"]},
                                  {"name": "甘南藏族自治州",
                                   "area": ["合作市", "临潭县", "卓尼县", "舟曲县", "迭部县", "玛曲县", "碌曲县", "夏河县"]}]}, {"name": "青海省",
                                                                                                         "city": [{
                                                                                                                      "name": "西宁市",
                                                                                                                      "area": [
                                                                                                                          "城东区",
                                                                                                                          "城中区",
                                                                                                                          "城西区",
                                                                                                                          "城北区",
                                                                                                                          "大通回族土族自治县",
                                                                                                                          "湟中县",
                                                                                                                          "湟源县"]},
                                                                                                                  {
                                                                                                                      "name": "海东市",
                                                                                                                      "area": [
                                                                                                                          "乐都区",
                                                                                                                          "平安区",
                                                                                                                          "民和回族土族自治县",
                                                                                                                          "互助土族自治县",
                                                                                                                          "化隆回族自治县",
                                                                                                                          "循化撒拉族自治县"]},
                                                                                                                  {
                                                                                                                      "name": "海北藏族自治州",
                                                                                                                      "area": [
                                                                                                                          "门源回族自治县",
                                                                                                                          "祁连县",
                                                                                                                          "海晏县",
                                                                                                                          "刚察县"]},
                                                                                                                  {
                                                                                                                      "name": "黄南藏族自治州",
                                                                                                                      "area": [
                                                                                                                          "同仁县",
                                                                                                                          "尖扎县",
                                                                                                                          "泽库县",
                                                                                                                          "河南蒙古族自治县"]},
                                                                                                                  {
                                                                                                                      "name": "海南藏族自治州",
                                                                                                                      "area": [
                                                                                                                          "共和县",
                                                                                                                          "同德县",
                                                                                                                          "贵德县",
                                                                                                                          "兴海县",
                                                                                                                          "贵南县"]},
                                                                                                                  {
                                                                                                                      "name": "果洛藏族自治州",
                                                                                                                      "area": [
                                                                                                                          "玛沁县",
                                                                                                                          "班玛县",
                                                                                                                          "甘德县",
                                                                                                                          "达日县",
                                                                                                                          "久治县",
                                                                                                                          "玛多县"]},
                                                                                                                  {
                                                                                                                      "name": "玉树藏族自治州",
                                                                                                                      "area": [
                                                                                                                          "玉树市",
                                                                                                                          "杂多县",
                                                                                                                          "称多县",
                                                                                                                          "治多县",
                                                                                                                          "囊谦县",
                                                                                                                          "曲麻莱县"]},
                                                                                                                  {
                                                                                                                      "name": "海西蒙古族藏族自治州",
                                                                                                                      "area": [
                                                                                                                          "格尔木市",
                                                                                                                          "德令哈市",
                                                                                                                          "乌兰县",
                                                                                                                          "都兰县",
                                                                                                                          "天峻县"]}]},
                        {"name": "宁夏回族自治区",
                         "city": [{"name": "银川市", "area": ["兴庆区", "西夏区", "金凤区", "永宁县", "贺兰县", "灵武市"]},
                                  {"name": "石嘴山市", "area": ["大武口区", "惠农区", "平罗县"]},
                                  {"name": "吴忠市", "area": ["利通区", "红寺堡区", "盐池县", "同心县", "青铜峡市"]},
                                  {"name": "固原市", "area": ["原州区", "西吉县", "隆德县", "泾源县", "彭阳县"]},
                                  {"name": "中卫市", "area": ["沙坡头区", "中宁县", "海原县"]}]}, {"name": "新疆维吾尔自治区", "city": [
                    {"name": "乌鲁木齐市", "area": ["天山区", "沙依巴克区", "新市区", "水磨沟区", "头屯河区", "达坂城区", "米东区", "乌鲁木齐县"]},
                    {"name": "克拉玛依市", "area": ["独山子区", "克拉玛依区", "白碱滩区", "乌尔禾区"]},
                    {"name": "吐鲁番市", "area": ["高昌区", "鄯善县", "托克逊县"]},
                    {"name": "哈密市", "area": ["伊州区", "巴里坤哈萨克自治县", "伊吾县"]},
                    {"name": "昌吉回族自治州", "area": ["昌吉市", "阜康市", "呼图壁县", "玛纳斯县", "奇台县", "吉木萨尔县", "木垒哈萨克自治县"]},
                    {"name": "博尔塔拉蒙古自治州", "area": ["博乐市", "阿拉山口市", "精河县", "温泉县"]},
                    {"name": "巴音郭楞蒙古自治州", "area": ["库尔勒市", "轮台县", "尉犁县", "若羌县", "且末县", "焉耆回族自治县", "和静县", "和硕县", "博湖县"]},
                    {"name": "阿克苏地区", "area": ["阿克苏市", "温宿县", "库车县", "沙雅县", "新和县", "拜城县", "乌什县", "阿瓦提县", "柯坪县"]},
                    {"name": "克孜勒苏柯尔克孜自治州", "area": ["阿图什市", "阿克陶县", "阿合奇县", "乌恰县"]}, {"name": "喀什地区",
                                                                                       "area": ["喀什市", "疏附县", "疏勒县",
                                                                                                "英吉沙县", "泽普县", "莎车县",
                                                                                                "叶城县", "麦盖提县", "岳普湖县",
                                                                                                "伽师县", "巴楚县",
                                                                                                "塔什库尔干塔吉克自治县"]},
                    {"name": "和田地区", "area": ["和田市", "和田县", "墨玉县", "皮山县", "洛浦县", "策勒县", "于田县", "民丰县"]},
                    {"name": "伊犁哈萨克自治州",
                     "area": ["伊宁市", "奎屯市", "霍尔果斯市", "伊宁县", "察布查尔锡伯自治县", "霍城县", "巩留县", "新源县", "昭苏县", "特克斯县", "尼勒克县"]},
                    {"name": "塔城地区", "area": ["塔城市", "乌苏市", "额敏县", "沙湾县", "托里县", "裕民县", "和布克赛尔蒙古自治县"]},
                    {"name": "阿勒泰地区", "area": ["阿勒泰市", "布尔津县", "富蕴县", "福海县", "哈巴河县", "青河县", "吉木乃县"]}]},
                        {"name": "台湾省", "city": []}, {"name": "香港特别行政区", "city": []}, {"name": "澳门特别行政区", "city": []}]
            list_province = []  # 省
            list_city = []  # 市
            list_province_city = []  # 省、市
            list_province_city_county = []  # 省、市、区/县
            if flag == 0:
                for x in list_msg:
                    list_province.append(x["name"])
                return [random.choice(list_province)]
            elif flag == 1:
                for m in list_msg:
                    for n in m["city"]:
                        list_city.append(n["name"])
                return [random.choice(list_city)]
            elif flag == 2:
                for m in list_msg:
                    for n in m["city"]:
                        list_province_city.append([m["name"], n["name"]])
                return random.choice(list_province_city)
            elif flag == 3:
                for m in list_msg:
                    for n in m["city"]:
                        for k in n["area"]:
                            list_province_city_county.append([m["name"], n["name"], k])
                if native_place:
                    return ["-".join(random.choice(list_province_city_county))]
                else:
                    return random.choice(list_province_city_county)
        else:
            return "flag only in [0,1,2,3] "

    @staticmethod
    def random_sex(flag=True):
        """
        随机生成性别
        :param flag: True，返回0/1，False，返回男/女
        :return:
        """
        if flag:
            return random.randint(0, 1)
        else:
            return random.choice(["男", "女"])

    @staticmethod
    def random_health():
        """
        随机生成健康状况
        :return: 健康状况
        """
        # 比例：健康4：良好3：一般2：较差1：残疾1
        return random.choice(["健康", "健康","健康","健康","良好","良好","良好","一般","一般","较差","残疾"])

    @staticmethod
    def random_position_grade(flag=0):
        """
        随机生成职位、职称、级别
        :param flag:
            0：随机生成职位/岗位；
            1：随机生成职称；
            2：级别高低
        :return:
        """
        # 职位/岗位
        str_position = ['后端开发', 'Ruby', 'Java', 'Perl', '语音/视频/图形开发', '数据采集', 'Erlang', 'VB', 'Hadoop', 'Delphi', 'PHP', 'C++', '后端开发', 'C', 'Golang', 'Node.js', 'Python', 'C#', '全栈工程师', '.NET', 'GIS工程师', '移动开发', 'JavaScript', 'U3D', 'Android', 'HTML5', 'iOS', 'Flash开发', '移动web前端', '移动开发', 'UE4', 'COCOS2DX', '测试', '测试工程师', '渗透测试', '软件测试', '性能测试', '游戏测试', '功能测试', '硬件测试', '测试开发', '移动端测试', '自动化测试', '运维/技术支持', 'DBA', 'IT技术支持', '运维工程师', '系统工程师', '网络安全', '系统安全', '网络工程师', '运维开发工程师', '系统管理员', '数据', '数据架构师', '数据分析师', '数据开发', '数据仓库', '数据挖掘', '数据', 'ETL工程师', '项目管理', '实施顾问', '需求分析工程师', '项目专员', '项目经理', '项目主管', '实施工程师', '硬件项目经理', '项目助理', '硬件开发', '自动化', '硬件工程师', '电路设计', '射频工程师', '系统集成', 'PCB工艺', 'FPGA开发', 'DSP开发', 'ARM开发', '嵌入式', '单片机', '驱动开发', '前端开发', 'HTML5', 'JavaScript', 'Flash开发', 'web前端', '前端开发', '通信', '无线/射频通信工程师', '核心网工程师', '光网络工程师', '通信项目专员', '光传输工程师', '通信研发工程师', '通信标准化工程师', '光通信工程师', '通信设备工程师', '通信测试工程师', '数据通信工程师', '电信交换工程师', '电信网络工程师', '有线传输工程师', '通信技术工程师', '移动通信工程师', '通信项目经理', '通信电源工程师', '电子/半导体', '电气设计工程师', '电气工程师', 'IC验证工程师', '电子工程师', 'FAE', '集成电路IC设计', '高端技术职位', '架构师', '高端技术职位', '技术合伙人', '技术经理', 'CTO', '技术总监', '运维总监', '测试经理', '人工智能', '图像识别', '自然语言处理', '语音识别', '推荐算法', '搜索算法', '反欺诈/风控算法', '算法研究员', '算法工程师', '智能驾驶系统工程师', '人工智能', '数据挖掘', '深度学习', '机器学习', '销售技术支持', '售前技术支持', '售后技术支持', '销售技术支持', '产品', '产品经理', '产品总监', '数据产品经理', '产品', '产品经理', '网页产品经理', '产品专员', '硬件产品经理', '游戏策划', '产品助理', '产品经理', '数据产品经理', '移动产品经理', '电商产品经理', '高端产品职位', '产品总监', '游戏制作人', '高端产品职位', '产品VP', '设计', 'UI设计师', '平面设计', '交互设计师', '设计', '视觉/交互设计', '网页设计师', '动画设计', '设计师助理', 'Flash设计师', '人像修图师', 'UI设计师', '插画师', '原画师', '视觉设计师', '3D设计师', '漫画师', '视觉设计', '多媒体设计师', '包装设计', 'APP设计师', '平面设计', '交互设计师', 'CAD设计/制图', '美工', '广告设计', '游戏设计', '游戏特效', '游戏角色', '游戏场景', '游戏数值策划', '游戏动作', '游戏界面设计师', '用户研究', '用户研究总监', 'UX设计师', '用户研究经理', '用户研究员', '数据分析师', '高端设计职位', '设计经理/主管', '视觉设计总监', '高端设计职位', '设计总监', '非视觉设计', '家具设计', '照明设计', '工业设计', '家居设计', '服装/纺织设计', '展览/展示设计', '珠宝设计', '非视觉设计', '陈列设计', '室内设计', '橱柜设计', '运营', '新媒体运营', '产品运营', '网络推广', '运营', '运营', '车辆运营', '线下拓展运营', '网站运营', '数据运营', '内容运营', '活动运营', '运营', '直播运营', '微信运营', '新媒体运营', '社区运营', '用户运营', '商家运营', '游戏运营', '微博运营', '跨境电商运营', '电商运营', '品类运营', '内容审核', '策略运营', '网店店长', '数据标注', '运营助理/专员', '产品运营', '编辑', '医学编辑', '网站编辑', '内容编辑', '采编', '编辑', '文案策划', '副主编', '客服', '售前客服', '客服专员', '电话客服', '网络客服', '客服主管', '售后客服', '咨询热线/呼叫中心客服', '客服经理', '高端运营职位', '运营总监', '运营经理/主管', '高端运营职位', '客服总监', '主编', 'COO', '市场', '市场营销', '市场推广', '品牌公关', '策划经理', '市场', '政府事务', '政策研究', '企业党建', '政府关系', '市场/营销', '商业数据分析', '市场推广', '海外市场', '活动策划', 'SEO', 'SEM', '商务渠道', '游戏推广', '选址开发', '市场营销', '营销主管', 'APP推广', '网络营销', '网络推广', '市场策划', '市场顾问', '公关媒介', '品牌公关', '广告协调', '媒介策划', '公关媒介', '活动策划执行', '媒介专员', '媒介经理', '会务会展', '会展活动执行', '会议活动策划', '会展活动策划', '会议活动执行', '会务会展', '广告', '媒介投放', '广告文案', '广告/会展项目经理', '广告', '广告设计', '广告创意设计', '媒介合作', '美术指导', '策划经理', '广告审核', '广告制作', '高端市场职位', '媒介总监', '高端市场职位', '市场总监', 'CMO', '创意总监', '公关总监', '人事/财务/行政', '人力资源专员/助理', '行政主管', '财务顾问', '培训', '绩效考核', '人事/财务/行政', '人力资源', '员工关系', '组织发展', '人力资源VP/CHO', '绩效考核', 'HRBP', '培训', '招聘', '薪资福利', '人力资源总监', '人力资源专员/助理', '人力资源经理', '人力资源主管', '行政', '经理助理', '行政主管', '行政经理', '前台', '行政专员/助理', '后勤', '行政总监', '财务', '财务总监', '总账会计', '财务主管', '财务顾问', '财务', '成本', '风控', '结算', '审计', '出纳', 'CFO', '会计', '财务经理', '税务', '法务', '法务专员/助理', '法务主管', '律师', '法律顾问', '法务经理', '法务总监', '高级管理', '总裁/总经理/CEO', '分公司/代表处负责人', '高级管理', '高级管理职位', '高级管理职位', '总助/CEO助理/董事长助理', '分公司/代表处负责人', '副总裁/副总经理/VP', '合伙人', '总裁/总经理/CEO', '董事会秘书', '区域负责人(辖多个分公司)', '联合创始人', '显示全部职位', '销售', '销售专员', '销售经理', '销售工程师', '销售', '销售行政/商务', '商务经理', '销售运营', '商务专员', '商务总监', '销售助理', '房地产销售/招商', '置业顾问', '房地产销售总监', '物业招商管理', '地产中介', '房地产销售/招商', '服务业销售', '美容顾问', '会籍顾问', '珠宝销售', '旅游顾问', '彩妆顾问', '瘦身顾问', '汽车销售', '汽车销售', '汽车配件销售', '广告/会展销售', '媒介顾问', '会展活动销售', '会议活动销售', '广告销售', '金融销售', '信用卡销售', '保险顾问', '理财顾问', '证券经纪人', '外贸销售', '外贸经理', '外贸业务员', '销售', '代理商销售', '客户代表', '电话销售', '销售专员', '客户经理', '大客户代表', '销售工程师', '销售', 'BD经理', '渠道销售', '销售顾问', '网络销售', '课程销售', '留学顾问', '招生顾问', '课程顾问', '医疗销售', '医疗器械销售', '医药代表', '医美咨询', '健康顾问', '医疗销售', '销售管理', '销售经理', '销售总监', '城市经理', '团队经理', '区域总监', '销售VP', '销售管理', '传媒', '广告文案', '广告创意设计', '编辑', '记者', '媒介经理', '传媒', '采编/写作/出版', '自媒体', '校对录入', '采编', '撰稿人', '出版发行', '编辑', '记者', '总编', '排版设计', '采编/写作/出版', '公关媒介', '媒介经理', '公关媒介', '媒介策划', '媒介专员', '品牌公关', '广告协调', '活动策划执行', '广告', '策划经理', '媒介投放', '广告设计', '广告文案', '广告创意设计', '广告制作', '媒介合作', '广告审核', '广告/会展项目经理', '广告', '美术指导', '影视媒体', '制片人', '剪辑师', '演员/配音/模特', '影视特效', '视频编辑', '音频编辑', '主播助理', '影视媒体', '主播', '放映员', '艺人助理', '导演/编导', '影视发行', '录音/音效', '摄影/摄像', '主持人/DJ', '后期制作', '灯光师', '经纪人', '编剧', '影视策划', '化妆/造型/服装', '金融', '投资经理', '投资总监', '风控', '证券', '金融', '投融资', '投资总监', '行业研究', '资产管理', '投后管理', '投融资', '投资顾问', '融资', '投资助理', '投资VP', '投资合伙人', '投资经理', '并购', '风控', '资信评估', '合规稽查', '风控', '律师', '税务审计', '会计', '审计', '清算', '法务', '银行', '大堂经理', '客户经理', '风控', '信贷管理', '柜员', '分析师', '银行', '商务渠道', '互联网金融', '催收员', '互联网金融', '投资经理', '清算', '风控', '金融产品经理', '审计', '分析师', '保险', '保险精算师', '保险理赔', '证券', '证券分析师', '交易员', '证券', '教育培训', '课程设计', '教务管理', 'IT培训', '教育培训', '教育产品研发', '教育产品研发', '课程编辑', '培训研究', '培训策划', '培训师', '课程设计', '教育行政', '园长/副园长', '教学管理', '校长/副校长', '教务管理', '教育行政', '班主任/辅导员', '教师', '生物教师', '幼教', '物理教师', '日语教师', '美术教师', '体育教师', '初中教师', '理科教师', '就业老师', '早教老师', '家教', '音乐教师', '化学教师', '英语教师', '数学教师', '文科教师', '教师', '托管老师', '高中教师', '助教', '语文教师', '小学教师', 'IT培训', '软件测试培训讲师', 'IT培训', 'Web前端培训讲师', 'iOS培训讲师', 'PHP培训讲师', 'UI设计培训讲师', 'JAVA培训讲师', '.NET培训讲师', '动漫培训讲师', 'C++培训讲师', 'Unity3D培训讲师', 'Android培训讲师', '职业培训', 'HR培训讲师', '培训师', '拓展培训', '财会培训讲师', '特长培训', '机器人教师', '游泳教练', '播音主持教师', '教练', '古筝教师', '书法教师', '篮球/羽毛球教练', '乐高教师', '吉他教师', '武术教练', '跆拳道教练', '钢琴教师', '表演教师', '舞蹈老师', '健身教练', '瑜伽老师', '轮滑教练', '医疗健康', '药剂师', '营养师', '医疗器械研发', '医疗健康', '临床试验', '临床协调', '临床数据分析', '医学总监', '临床研究', '临床项目经理', '医生/医技', '中医', '医生', '康复治疗师', '验光师', '全科医生', '内科医生', '药剂师', '医学影像/放射科医师', '心理医生', 'B超医生', '检验科医师', '医生助理', '牙科医生', '护士/护理', '导医', '护士', '护士长', '健康整形', '健康整形', '理疗师', '针灸推拿', '整形师', '营养师', '生物制药', '医药项目经理', '生物制药', '医药研发', '药品注册', '药品生产', '医疗器械', '医疗器械注册', '医疗器械研发', '医疗器械生产/质量管理', '药店', '执业药师/驻店药师', '药店店员', '药店店长', '采购/贸易', '采购经理', '采购主管', '进出口贸易', '采购/贸易', '采购', '商品经理', '买手', '供应商质量工程师', '采购', '采购主管', '采购经理', '采购工程师', '采购总监', '采购专员', '采购助理', '进出口贸易', '报关/报检员', '单证员', '进出口贸易', '贸易跟单', '供应链/物流', '物流专员', '贸易跟单', '供应链经理', '供应链/物流', '物流', '供应链专员', '物流跟单', '供应链经理', '核销员', '集装箱管理', '货运代理经理', '物流运营', '货运代理专员', '物流', '物流/仓储项目经理', '物流专员', '调度员', '物流经理', '水/空/陆运操作', '仓储', '仓储', '仓库经理', '仓库文员', '仓库管理员', '配/理/拣/发货', '交通/运输', '交通/运输', '快递员', '货运司机', '配送员', '驾校教练', '商务司机', '网约车司机', '运输经理/主管', '代驾司机', '高端供应链职位', '供应链总监', '高端供应链职位', '物流总监', '房地产/建筑', '物业经理', '房地产规划开发', '房地产/建筑', '房地产规划开发', '地产项目管理', '房地产规划开发', '房产评估师', '地产招投标', '房地产策划', '设计装修与市政建设', '工程监理', '施工员', '施工安全员', '软装设计师', '弱电工程师', '幕墙工程师', '室内设计', '建筑设计师', '建筑机电工程师', '土木/土建/结构工程师', '工程预算', '设计装修与市政建设', '城市规划设计', '建筑工程师', '园林/景观设计', '暖通工程师', '给排水工程师', '材料员', '资料员', '建筑施工现场管理', 'BIM工程师', '工程造价', '测绘/测量', '消防工程师', '装修项目经理', '物业管理', '物业管理员', '物业维修', '绿化工', '物业经理', '高端房地产职位', '地产项目总监', '地产策划总监', '高端房地产职位', '地产招投标总监', '咨询/翻译/法律', '企业管理咨询', '事务所律师', '咨询/翻译/法律', '咨询/调研', '咨询项目管理', '战略咨询', '心理咨询师', '咨询经理', '人力资源咨询顾问', '知识产权/专利/商标代理人', '猎头顾问', '咨询总监', '婚恋咨询师', 'IT咨询顾问', '市场调研', '企业管理咨询', '财务咨询顾问', '数据分析师', '咨询/调研', '律师', '专利律师', '律师助理', '法务', '事务所律师', '知识产权律师', '翻译', '日语翻译', '西班牙语翻译', '德语翻译', '俄语翻译', '英语翻译', '韩语/朝鲜语翻译', '法语翻译', '旅游', '旅游顾问', '导游', '旅游产品开发/策划', '旅游', '旅游服务', '签证专员', '旅游服务', '导游', '计调', '讲解员', '预定票务', '旅游产品开发/策划', '旅游产品开发/策划', '旅游产品经理', '旅游策划师', '服务业', '服务员', '客房服务员', '发型师', '服务业', '餐饮', '面点师', '厨师', '后厨', '厨师长', '烧烤师傅', '收银', '行政总厨', '中餐厨师', '咖啡师', '西餐厨师', '餐饮', '茶艺师', '服务员', '日料厨师', '领班', '餐饮学徒', '送餐员', '西点师', '传菜员', '餐饮店长', '洗碗工', '配菜打荷', '凉菜厨师', '酒店', '收银', '酒店经理', '客房经理', '前厅经理', '酒店前台', '礼仪/迎宾/接待', '客房服务员', '零售', '促销员', '门店店长', '陈列员', '督导/巡店', '收银', '店员/营业员', '卖场经理', '理货员', '导购', '防损员', '美容保健', '美甲师', '足疗师', '美容师', '按摩师', '美体师', '养发师', '美睫师', '纹绣师', '美发学徒', '化妆师', '发型师', '美容店长', '运动健身', '游泳教练', '瑜伽老师', '健身教练', '舞蹈老师', '健身', '美体教练', '救生员', '婚礼/花艺', '婚礼策划', '花艺师', '宠物服务', '宠物医生', '宠物美容', '安保/家政/维修', '手机维修', '保洁', '消防中控员', '家电维修', '护工', '月嫂', '押运员', '产后康复师', '保姆', '育婴师', '保洁经理', '保安经理', '地铁安检', '钟点工', '保安', '生产制造', '生产总监', '生产员', '质量管理/测试', '生产制造', '生产营运', '生产营运', '生产组长/拉长', '生产跟单', '生产设备管理', '车间主任', '生产员', '生产总监', '生产计划管理', '厂长', '质量安全', '故障分析师', '质量管理/测试', '汽车质量工程师', '体系工程师', '可靠度工程师', '认证工程师', '生产安全员', '质检员', '审核员', '新能源', '充电桩设计', '线束设计', '电机工程师', '电池工程师', '汽车制造', '动力系统工程师', '底盘工程师', '车身/造型设计', '内外饰设计工程师', '汽车项目管理', '总装工程师', '汽车电子工程师', '汽车零部件设计', '汽车设计', '汽车服务', '汽车美容', '4S店店长/维修站长', '汽车服务顾问', '二手车评估师', '汽车维修', '汽车改装工程师', '汽车定损理赔', '机械设计/制造', '机械维修/保养', 'CNC/数控', '机械工程师', '机械设计/制造', '工艺/制程工程师', '工业工程师', '热设计工程师', '精益工程师', '材料工程师', '机械设备工程师', '机械设计师', '夹具工程师', '冲压工程师', '注塑工程师', '机械结构工程师', '机电工程师', '机械制图', '铸造/锻造工程师', '焊接工程师', '模具工程师', '化工', '实验室技术员', '化学分析', '食品/饮料研发', '涂料研发', '化工工程师', '化工项目经理', '化妆品研发', '服装/纺织/皮革', '面料辅料开发', '服装/纺织设计', '服装/纺织/皮革跟单', '打样/制版', '技工/普工', '机修工', '包装工', '氩弧焊工', '铣工', '喷塑工', '电梯工', '样衣工', '铆工', '铲车司机', '折弯工', '电镀工', '钣金工', '钻工', '注塑工', '叉车工', '电工', '钳工', '搬运工', '木工', '空调工', '焊工', '切割工', '学徒工', '抛光工', '缝纫工', '油漆工', '磨工', '组装工', '锅炉工', '普工/操作工', '模具工', '车工']
        # 职称
        str_title_technical_post_full = """助教，助理工程师，助理实验师，实习研究员，医（药、护、技）士，助理会计师，助理兽医师，助理畜牧师，助理农艺师，讲师，助理研究员，工程师，主治（管）医（药、护、技）师，执业兽医师 助理执业兽医师，记者（编辑），二级律师 三级律师，二级公证员，三级公证员，高级实习指导教师讲师，一级实习指导教师，中学高级教师中学一级教师，小学高级教师小学一级教师，实验师，教练，农艺（畜牧、兽医）师，编辑，国际财务管理师，经济师，会计师，统计师，翻译，关务监督，工艺美术师，馆员，二级飞行（领航、飞行通信、飞行机械）员，二级演员，文学创作二级创作员，教授、副教授，研究员、副研究员，教授、研究员级高级工程师 高级工程师，主任医（药、护、技）师，副主任医（药、护、技）师，高级记者（编辑），主任记者（编辑），播音指导，主任播音员 一级播音员，一级律师，一级公证员，高级讲师，高级农艺（畜牧、兽医）师，高级实验师，高级教练，编审、副编审，高级国际财务管理师，高级经济师，高级会计师，高级统计师，译审、副译审，高级关务监督，高级工艺美术师，研究馆员、副研究馆员，一级飞行（领航、飞行通信、飞行机械）员，一级演员，文学创作一级创作员，出版专业中级，信息系统项目管理师，系统分析师，网络规划设计师，棉花质量检验师，注册核安全工程师，注册验船师，质量专业中级，软件设计师，网络工程师，信息系统监理师，系统集成项目管理工程师，信息系统管理工程师，数据库系统工程师，多媒体应用设计师，计算机软件高级程序员，系统分析师，信息系统项目管理师，软件评测师，软件设计师，环境影响评价工程师，通信专业技术人员中级职业水平，一级注册计量师，注册测绘师，造价工程师，注册安全工程师，国际商务执业资格，房地产估价师，注册资产评估师，土地登记代理人，注册税务师，招标师，广告师，企业法律顾问，价格鉴证师，房地产经纪人执业资格，物业管理师，管理咨询师，注册城市规划师，社会工作师，执业药师(执业中药师)"""
        str_title_technical_post = """正高级，高级，中级，初级"""
        if flag == 0:
            return random.choice(str_position)
        elif flag == 1:
            return random.choice(str_title_technical_post_full.split("，"))
        elif flag == 2:
            return random.choice(str_title_technical_post.split("，"))

    @staticmethod
    def random_party(flag=3):
        """
        随机生成政治面貌
        :param flag:
            0： 随机返回 ["共产党员","共青团"]；
            1：返回 “群众”
            2：随机返回 ["共产党员","共青团","群众"]
            3：随机返回 包含共产党及其他八大党及群众;
            4: 随机返回 ["共产党员","共青团","群众"], 群众频次4倍于党员、共青团
        :return:
        """
        str_party_1 = ["中共党员", "共青团员"]
        str_party_2 = ["群众"]
        str_party_3 = ["国民党革命委员会","民主建国会","民主同盟","农工民主党","民主促进会","致公党","九三学社","台湾民主自治同盟"]
        if flag == 0:
            return random.choice(str_party_1)
        elif flag == 1:
            return str_party_2[0]
        elif flag == 2:
            return random.choice(str_party_1+str_party_2)
        elif flag == 3:
            return random.choice(str_party_1+str_party_2+str_party_3)
        elif flag == 4:
            return random.choice(str_party_1 + str_party_2*4)

    @staticmethod
    def random_marriage():
        """
        婚姻状况（权重查看代码）
        :return:
        """
        str_1 = ["已婚"]*3
        str_2 = ["未婚"]*6
        str_3 = ["离异","再婚"]
        str_marriage=str_1+str_2+str_3
        return random.choice(str_marriage)

    @staticmethod
    def random_family(flag=0):
        """
        随机生成家庭主要成员
        :param flag:
            0： 返回：["父亲","母亲","妻子","儿子","女儿","丈夫"]
            1： 返回：["父亲","母亲"]
            2： 返回三子以内所有成员
        :return:
        """
        str_family_parent = ["父亲","母亲"]
        str_family_full = ["父亲","母亲","妻子","儿子","女儿","丈夫"]
        str_family = ["妹妹","弟弟","父亲","母亲","妻子","丈夫","儿子","女儿","长子","次子","三子","长女","次女","三女","哥哥","姐姐"]
        if flag == 0:
            return random.choice(str_family_full)
        elif flag == 1:
            return random.choice(str_family_parent)
        else:
            return random.choice(str_family)

    @staticmethod
    def random_phone():
        """
        随机生成手机号
        :return:
        """
        # 第二位数字
        second = [3, 4, 5, 7, 8][random.randint(0, 4)]
        # 第三位数字
        third = {
            3: random.randint(0, 9),
            4: [5, 7, 9][random.randint(0, 2)],
            5: [i for i in range(10) if i != 4][random.randint(0, 8)],
            7: [i for i in range(10) if i not in [4, 9]][random.randint(0, 7)],
            8: random.randint(0, 9),
        }[second]
        # 最后八位数字
        suffix = random.randint(9999999, 100000000)
        # 拼接手机号
        return "1{}{}{}".format(second, third, suffix)

    @staticmethod
    def random_id_card():
        """
        随机生成身份证号
        :return:
        """
        def _regiun():
            # 生成身份证前六位-列表里面的都是一些地区的前六位号码
            first_list = ["110000","110100","110101","110102","110103","110104","110105","110106","110107","110108","110109","110111","110112","110113","110200","110221","110224","110226","110227","110228","110229","120000","120100","120101","120102","120103","120104","120105","120106","120107","120108","120109","120110","120111","120112","120113","120200","120221","120222","120223","120224","120225","130000","130100","130101","130102","130103","130104","130105","130106","130107","130121","130123","130124","130125","130126","130127","130128","130129","130130","130131","130132","130133","130181","130182","130183","130184","130185","130200","130201","130202","130203","130204","130205","130206","130221","130223","130224","130225","130227","130229","130230","130281","130282","130283","130300","130301","130302","130303","130304","130321","130322","130323","130324","130400","130401","130402","130403","130404","130406","130421","130423","130424","130425","130426","130427","130428","130429","130430","130431","130432","130433","130434","130435","130481","130500","130501","130502","130503","130521","130522","130523","130524","130525","130526","130527","130528","130529","130530","130531","130532","130533","130534","130535","130581","130582","130600","130601","130602","130603","130604","130621","130622","130623","130624","130625","130626","130627","130628","130629","130630","130631","130632","130633","130634","130635","130636","130637","130638","130681","130682","130683","130684","130700","130701","130702","130703","130705","130706","130721","130722","130723","130724","130725","130726","130727","130728","130729","130730","130731","130732","130733","130800","130801","130802","130803","130804","130821","130822","130823","130824","130825","130826","130827","130828","130900","130901","130902","130903","130921","130922","130923","130924","130925","130926","130927","130928","130929","130930","130981","130982","130983","130984","131000","131001","131002","131022","131023","131024","131025","131026","131028","131081","131082","131100","131101","131102","131121","131122","131123","131124","131125","131126","131127","131128","131181","131182","140000","140100","140101","140105","140106","140107","140108","140109","140110","140121","140122","140123","140181","140200","140201","140202","140203","140211","140212","140221","140222","140223","140224","140225","140226","140227","140300","140301","140302","140303","140311","140321","140322","140400","140401","140402","140411","140421","140423","140424","140425","140426","140427","140428","140429","140430","140431","140481","140500","140501","140502","140521","140522","140524","140525","140581","140600","140601","140602","140603","140621","140622","140623","140624","142200","142201","142202","142222","142223","142225","142226","142227","142228","142229","142230","142231","142232","142233","142234","142300","142301","142302","142303","142322","142323","142325","142326","142327","142328","142329","142330","142332","142333","142400","142401","142402","142421","142422","142423","142424","142427","142429","142430","142431","142433","142600","142601","142602","142603","142621","142622","142623","142625","142627","142628","142629","142630","142631","142632","142633","142634","142635","142636","142700","142701","142702","142703","142723","142724","142725","142726","142727","142729","142730","142731","142732","142733","150000","150100","150101","150102","150103","150104","150105","150121","150122","150123","150124","150125","150200","150201","150202","150203","150204","150205","150206","150207","150221","150222","150223","150300","150301","150302","150303","150304","150400","150401","150402","150403","150404","150421","150422","150423","150424","150425","150426","150428","150429","150430","152100","152101","152102","152103","152104","152105","152106","152122","152123","152127","152128","152129","152130","152131","152200","152201","152202","152221","152222","152223","152224","152300","152301","152302","152322","152323","152324","152325","152326","152327","152500","152501","152502","152522","152523","152524","152525","152526","152527","152528","152529","152530","152531","152600","152601","152602","152624","152625","152626","152627","152629","152630","152631","152632","152634","152700","152701","152722","152723","152724","152725","152726","152727","152728","152800","152801","152822","152823","152824","152825","152826","152827","152900","152921","152922","152923","210000","210100","210101","210102","210103","210104","210105","210106","210111","210112","210113","210114","210122","210123","210124","210181","210200","210201","210202","210203","210204","210211","210212","210213","210224","210281","210282","210283","210300","210301","210302","210303","210304","210311","210321","210323","210381","210400","210401","210402","210403","210404","210411","210421","210422","210423","210500","210501","210502","210503","210504","210505","210521","210522","210600","210601","210602","210603","210604","210624","210681","210682","210700","210701","210702","210703","210711","210726","210727","210781","210782","210800","210801","210802","210803","210804","210811","210881","210882","210900","210901","210902","210903","210904","210905","210911","210921","210922","211000","211001","211002","211003","211004","211005","211011","211021","211081","211100","211101","211102","211103","211121","211122","211200","211201","211202","211204","211221","211223","211224","211281","211282","211300","211301","211302","211303","211321","211322","211324","211381","211382","211400","211401","211402","211403","211404","211421","211422","211481","220000","220100","220101","220102","220103","220104","220105","220106","220112","220122","220181","220182","220183","220200","220201","220202","220203","220204","220211","220221","220281","220282","220283","220284","220300","220301","220302","220303","220322","220323","220381","220382","220400","220401","220402","220403","220421","220422","220500","220501","220502","220503","220521","220523","220524","220581","220582","220600","220601","220602","220621","220622","220623","220625","220681","220700","220701","220702","220721","220722","220723","220724","220800","220801","220802","220821","220822","220881","220882","222400","222401","222402","222403","222404","222405","222406","222424","222426","230000","230100","230101","230102","230103","230104","230105","230106","230107","230108","230121","230123","230124","230125","230126","230127","230128","230129","230181","230182","230183","230184","230200","230201","230202","230203","230204","230205","230206","230207","230208","230221","230223","230224","230225","230227","230229","230230","230231","230281","230300","230301","230302","230303","230304","230305","230306","230307","230321","230381","230382","230400","230401","230402","230403","230404","230405","230406","230407","230421","230422","230500","230501","230502","230503","230505","230506","230521","230522","230523","230524","230600","230601","230602","230603","230604","230605","230606","230621","230622","230623","230624","230700","230701","230702","230703","230704","230705","230706","230707","230708","230709","230710","230711","230712","230713","230714","230715","230716","230722","230781","230800","230801","230802","230803","230804","230805","230811","230822","230826","230828","230833","230881","230882","230900","230901","230902","230903","230904","230921","231000","231001","231002","231003","231004","231005","231024","231025","231081","231083","231084","231085","231100","231101","231102","231121","231123","231124","231181","231182","232300","232301","232302","232303","232304","232324","232325","232326","232330","232331","232332","232700","232721","232722","232723","310000","310100","310101","310102","310103","310104","310105","310106","310107","310108","310109","310110","310112","310113","310114","310115","310116","310117","310200","310225","310226","310229","310230","320000","320100","320101","320102","320103","320104","320105","320106","320107","320111","320112","320113","320114","320121","320122","320123","320124","320125","320200","320201","320202","320203","320204","320211","320281","320282","320283","320300","320301","320302","320303","320304","320305","320311","320321","320322","320323","320324","320381","320382","320400","320401","320402","320404","320405","320411","320481","320482","320483","320500","320501","320502","320503","320504","320511","320581","320582","320583","320584","320585","320586","320600","320601","320602","320611","320621","320623","320681","320682","320683","320684","320700","320701","320703","320704","320705","320706","320721","320722","320723","320724","320800","320801","320802","320811","320821","320826","320829","320830","320831","320882","320900","320901","320902","320921","320922","320923","320924","320925","320928","320981","320982","321000","321001","321002","321011","321023","321027","321081","321084","321088","321100","321101","321102","321111","321121","321181","321182","321183","321200","321201","321202","321203","321281","321282","321283","321284","321300","321301","321302","321321","321322","321323","321324","330000","330100","330101","330102","330103","330104","330105","330106","330108","330122","330127","330181","330182","330183","330184","330185","330200","330201","330203","330204","330205","330206","330211","330225","330226","330227","330281","330282","330283","330300","330301","330302","330303","330304","330322","330324","330326","330327","330328","330329","330381","330382","330400","330401","330402","330411","330421","330424","330481","330482","330483","330500","330501","330521","330522","330523","330600","330601","330602","330621","330624","330681","330682","330683","330700","330701","330702","330721","330723","330726","330727","330781","330782","330783","330784","330800","330801","330802","330821","330822","330824","330825","330881","330900","330901","330902","330903","330921","330922","331000","331001","331002","331003","331004","331021","331022","331023","331024","331081","331082","332500","332501","332502","332522","332523","332525","332526","332527","332528","332529","340000","340100","340101","340102","340103","340104","340111","340121","340122","340123","340200","340201","340202","340203","340204","340207","340221","340222","340223","340300","340301","340302","340303","340304","340311","340321","340322","340323","340400","340401","340402","340403","340404","340405","340406","340421","340500","340501","340502","340503","340504","340505","340521","340600","340601","340602","340603","340604","340621","340700","340701","340702","340703","340711","340721","340800","340801","340802","340803","340811","340822","340823","340824","340825","340826","340827","340828","340881","341000","341001","341002","341003","341004","341021","341022","341023","341024","341100","341101","341102","341103","341122","341124","341125","341126","341181","341182","341200","341201","341202","341203","341204","341221","341222","341223","341224","341225","341226","341227","341281","341282","341300","341301","341302","341321","341322","341323","341324","342400","342401","342422","342423","342425","342426","342427","342500","342501","342502","342522","342523","342529","342530","342531","342600","342601","342622","342623","342625","342626","342900","342901","342921","342922","342923","350000","350100","350101","350102","350103","350104","350105","350111","350121","350122","350123","350124","350125","350128","350181","350182","350200","350201","350202","350203","350204","350205","350206","350211","350212","350300","350301","350302","350303","350321","350322","350400","350401","350402","350403","350421","350423","350424","350425","350426","350427","350428","350429","350430","350481","350500","350501","350502","350503","350504","350521","350524","350525","350526","350527","350581","350582","350583","350600","350601","350602","350603","350622","350623","350624","350625","350626","350627","350628","350629","350681","350700","350701","350702","350721","350722","350723","350724","350725","350781","350782","350783","350784","350800","350801","350802","350821","350822","350823","350824","350825","350881","352200","352201","352202","352203","352225","352227","352228","352229","352230","352231","360000","360100","360101","360102","360103","360104","360105","360111","360121","360122","360123","360124","360200","360201","360202","360203","360222","360281","360300","360301","360302","360313","360321","360322","360323","360400","360401","360402","360403","360421","360423","360424","360425","360426","360427","360428","360429","360430","360481","360500","360501","360502","360521","360600","360601","360602","360622","360681","360700","360701","360702","360721","360722","360723","360724","360725","360726","360727","360728","360729","360730","360731","360732","360733","360734","360735","360781","360782","362200","362201","362202","362203","362204","362226","362227","362228","362229","362232","362233","362300","362301","362302","362321","362322","362323","362324","362325","362326","362329","362330","362331","362334","362400","362401","362402","362421","362422","362423","362424","362425","362426","362427","362428","362429","362430","362432","362500","362502","362522","362523","362524","362525","362526","362527","362528","362529","362531","362532","370000","370100","370101","370102","370103","370104","370105","370112","370123","370124","370125","370126","370181","370200","370201","370202","370203","370205","370211","370212","370213","370214","370281","370282","370283","370284","370285","370300","370301","370302","370303","370304","370305","370306","370321","370322","370323","370400","370401","370402","370403","370404","370405","370406","370481","370500","370501","370502","370503","370521","370522","370523","370600","370601","370602","370611","370612","370613","370634","370681","370682","370683","370684","370685","370686","370687","370700","370701","370702","370703","370704","370705","370724","370725","370781","370782","370783","370784","370785","370786","370800","370801","370802","370811","370826","370827","370828","370829","370830","370831","370832","370881","370882","370883","370900","370901","370902","370911","370921","370923","370982","370983","371000","371001","371002","371081","371082","371083","371100","371101","371102","371121","371122","371200","371201","371202","371203","371300","371301","371302","371311","371312","371321","371322","371323","371324","371325","371326","371327","371328","371329","371400","371401","371402","371421","371422","371423","371424","371425","371426","371427","371428","371481","371482","371500","371501","371502","371521","371522","371523","371524","371525","371526","371581","372300","372301","372321","372323","372324","372325","372328","372330","372900","372901","372922","372923","372924","372925","372926","372928","372929","372930","410000","410100","410101","410102","410103","410104","410105","410106","410108","410122","410181","410182","410183","410184","410185","410200","410201","410202","410203","410204","410205","410211","410221","410222","410223","410224","410225","410300","410301","410302","410303","410304","410305","410306","410311","410322","410323","410324","410325","410326","410327","410328","410329","410381","410400","410401","410402","410403","410404","410411","410421","410422","410423","410425","410481","410482","410500","410501","410502","410503","410504","410511","410522","410523","410526","410527","410581","410600","410601","410602","410603","410611","410621","410622","410700","410701","410702","410703","410704","410711","410721","410724","410725","410726","410727","410728","410781","410782","410800","410801","410802","410803","410804","410811","410821","410822","410823","410825","410881","410882","410883","410900","410901","410902","410922","410923","410926","410927","410928","411000","411001","411002","411023","411024","411025","411081","411082","411100","411101","411102","411121","411122","411123","411200","411201","411202","411221","411222","411224","411281","411282","411300","411301","411302","411303","411321","411322","411323","411324","411325","411326","411327","411328","411329","411330","411381","411400","411401","411402","411403","411421","411422","411423","411424","411425","411426","411481","411500","411501","411502","411503","411521","411522","411523","411524","411525","411526","411527","411528","412700","412701","412702","412721","412722","412723","412724","412725","412726","412727","412728","412800","412801","412821","412822","412823","412824","412825","412826","412827","412828","412829","420000","420100","420101","420102","420103","420104","420105","420106","420107","420111","420112","420113","420114","420115","420116","420117","420200","420201","420202","420203","420204","420205","420222","420281","420300","420301","420302","420303","420321","420322","420323","420324","420325","420381","420500","420501","420502","420503","420504","420505","420521","420525","420526","420527","420528","420529","420581","420582","420583","420600","420601","420602","420606","420621","420624","420625","420626","420682","420683","420684","420700","420701","420702","420703","420704","420800","420801","420802","420821","420822","420881","420900","420901","420902","420921","420922","420923","420981","420982","420983","420984","421000","421001","421002","421003","421022","421023","421024","421081","421083","421087","421100","421101","421102","421121","421122","421123","421124","421125","421126","421127","421181","421182","421200","421201","421202","421221","421222","421223","421224","422800","422801","422802","422822","422823","422825","422826","422827","422828","429000","429001","429004","429005","429006","429021","430000","430100","430101","430102","430103","430104","430105","430111","430121","430122","430124","430181","430200","430201","430202","430203","430204","430211","430221","430223","430224","430225","430281","430300","430301","430302","430304","430321","430381","430382","430400","430401","430402","430403","430404","430411","430412","430421","430422","430423","430424","430426","430481","430482","430500","430501","430502","430503","430511","430521","430522","430523","430524","430525","430527","430528","430529","430581","430600","430601","430602","430603","430611","430621","430623","430624","430626","430681","430682","430700","430701","430702","430703","430721","430722","430723","430724","430725","430726","430781","430800","430801","430802","430811","430821","430822","430900","430901","430902","430903","430921","430922","430923","430981","431000","431001","431002","431003","431021","431022","431023","431024","431025","431026","431027","431028","431081","431100","431101","431102","431103","431121","431122","431123","431124","431125","431126","431127","431128","431129","431200","431201","431202","431221","431222","431223","431224","431225","431226","431227","431228","431229","431230","431281","432500","432501","432502","432503","432522","432524","433000","433001","433100","433101","433122","433123","433124","433125","433126","433127","433130","440000","440100","440101","440102","440103","440104","440105","440106","440107","440111","440112","440181","440182","440183","440184","440200","440201","440202","440203","440204","440221","440222","440224","440229","440232","440233","440281","440282","440300","440301","440303","440304","440305","440306","440307","440308","440400","440401","440402","440421","440500","440501","440506","440507","440508","440509","440510","440523","440582","440583","440600","440601","440602","440603","440681","440682","440683","440684","440700","440701","440703","440704","440781","440782","440783","440784","440785","440800","440801","440802","440803","440804","440811","440823","440825","440881","440882","440883","440900","440901","440902","440923","440981","440982","440983","441200","441201","441202","441203","441223","441224","441225","441226","441283","441284","441300","441301","441302","441322","441323","441324","441381","441400","441401","441402","441421","441422","441423","441424","441426","441427","441481","441500","441501","441502","441521","441523","441581","441600","441601","441602","441621","441622","441623","441624","441625","441700","441701","441702","441721","441723","441781","441800","441801","441802","441821","441823","441825","441826","441827","441881","441882","441900","441901","442000","442001","445100","445101","445102","445121","445122","445200","445201","445202","445221","445222","445224","445281","445300","445301","445302","445321","445322","445323","445381","450000","450100","450101","450102","450103","450104","450105","450106","450111","450121","450122","450200","450201","450202","450203","450204","450205","450211","450221","450222","450300","450301","450302","450303","450304","450305","450311","450321","450322","450323","450324","450325","450326","450327","450328","450329","450330","450331","450332","450400","450401","450403","450404","450411","450421","450422","450423","450481","450500","450501","450502","450503","450512","450521","450600","450601","450602","450603","450621","450681","450700","450701","450702","450703","450721","450722","450800","450801","450802","450803","450821","450881","450900","450901","450902","450921","450922","450923","450924","450981","452100","452101","452122","452123","452124","452126","452127","452128","452129","452130","452131","452132","452133","452200","452201","452223","452224","452225","452226","452227","452228","452229","452230","452231","452400","452402","452424","452427","452428","452600","452601","452622","452623","452624","452625","452626","452627","452628","452629","452630","452631","452632","452700","452701","452702","452723","452724","452725","452726","452727","452728","452729","452730","452731","460000","460001","460002","460003","460004","460005","460006","460007","460025","460026","460027","460028","460030","460031","460033","460034","460035","460036","460037","460038","460039","460100","460101","460102","460103","460104","460200","460201","500000","500100","500101","500102","500103","500104","500105","500106","500107","500108","500109","500110","500111","500112","500113","500200","500221","500222","500223","500224","500225","500226","500227","500228","500229","500230","500231","500232","500233","500234","500235","500236","500237","500238","500239","500240","500241","500242","500243","500300","500381","500382","500383","500384","510000","510100","510101","510104","510105","510106","510107","510108","510112","510113","510121","510122","510123","510124","510125","510129","510131","510132","510181","510182","510183","510184","510300","510301","510302","510303","510304","510311","510321","510322","510400","510401","510402","510403","510411","510421","510422","510500","510501","510502","510503","510504","510521","510522","510524","510525","510600","510601","510603","510623","510626","510681","510682","510683","510700","510701","510703","510704","510722","510723","510724","510725","510726","510727","510781","510800","510801","510802","510811","510812","510821","510822","510823","510824","510900","510901","510902","510921","510922","510923","511000","511001","511002","511011","511024","511025","511028","511100","511101","511102","511111","511112","511113","511123","511124","511126","511129","511132","511133","511181","511300","511301","511302","511303","511304","511321","511322","511323","511324","511325","511381","511500","511501","511502","511521","511522","511523","511524","511525","511526","511527","511528","511529","511600","511601","511602","511621","511622","511623","511681","513000","513001","513002","513021","513022","513023","513029","513030","513100","513101","513122","513123","513124","513125","513126","513127","513128","513200","513221","513222","513223","513224","513225","513226","513227","513228","513229","513230","513231","513232","513233","513300","513321","513322","513323","513324","513325","513326","513327","513328","513329","513330","513331","513332","513333","513334","513335","513336","513337","513338","513400","513401","513422","513423","513424","513425","513426","513427","513428","513429","513430","513431","513432","513433","513434","513435","513436","513437","513700","513701","513721","513722","513723","513800","513821","513822","513823","513824","513825","513826","513900","513901","513902","513921","513922","520000","520100","520101","520102","520103","520111","520112","520113","520121","520122","520123","520181","520200","520201","520202","520203","520221","520300","520301","520302","520321","520322","520323","520324","520325","520326","520327","520328","520329","520330","520381","520382","522200","522201","522222","522223","522224","522225","522226","522227","522228","522229","522230","522300","522301","522322","522323","522324","522325","522326","522327","522328","522400","522401","522422","522423","522424","522425","522426","522427","522428","522500","522501","522526","522527","522528","522529","522530","522600","522601","522622","522623","522624","522625","522626","522627","522628","522629","522630","522631","522632","522633","522634","522635","522636","522700","522701","522702","522722","522723","522725","522726","522727","522728","522729","522730","522731","522732","530000","530100","530101","530102","530103","530111","530112","530113","530121","530122","530124","530125","530126","530127","530128","530129","530181","530300","530301","530302","530321","530322","530323","530324","530325","530326","530328","530381","530400","530401","530402","530421","530422","530423","530424","530425","530426","530427","530428","532100","532101","532122","532123","532124","532125","532126","532127","532128","532129","532130","532131","532300","532301","532322","532323","532324","532325","532326","532327","532328","532329","532331","532500","532501","532502","532522","532523","532524","532525","532526","532527","532528","532529","532530","532531","532532","532600","532621","532622","532623","532624","532625","532626","532627","532628","532700","532701","532722","532723","532724","532725","532726","532727","532728","532729","532730","532800","532801","532822","532823","532900","532901","532922","532923","532924","532925","532926","532927","532928","532929","532930","532931","532932","533000","533001","533022","533023","533024","533025","533100","533101","533102","533103","533122","533123","533124","533200","533221","533222","533223","533224","533300","533321","533323","533324","533325","533400","533421","533422","533423","533500","533521","533522","533523","533524","533525","533526","533527","533528","540000","540100","540101","540102","540121","540122","540123","540124","540125","540126","540127","542100","542121","542122","542123","542124","542125","542126","542127","542128","542129","542132","542133","542134","542135","542136","542137","542200","542221","542222","542223","542224","542225","542226","542227","542228","542229","542231","542232","542233","542300","542301","542322","542323","542324","542325","542326","542327","542328","542329","542330","542331","542332","542333","542334","542335","542336","542337","542338","542400","542421","542422","542423","542424","542425","542426","542427","542428","542429","542430","542500","542521","542522","542523","542524","542525","542526","542527","542528","542600","542621","542622","542623","542624","542625","542626","542627","610000","610100","610101","610102","610103","610104","610111","610112","610113","610114","610115","610121","610122","610124","610125","610126","610200","610201","610202","610203","610221","610222","610300","610301","610302","610303","610321","610322","610323","610324","610326","610327","610328","610329","610330","610331","610400","610401","610402","610403","610404","610422","610423","610424","610425","610426","610427","610428","610429","610430","610431","610481","610500","610501","610502","610521","610522","610523","610524","610525","610526","610527","610528","610581","610582","610600","610601","610602","610621","610622","610623","610624","610625","610626","610627","610628","610629","610630","610631","610632","610700","610701","610702","610721","610722","610723","610724","610725","610726","610727","610728","610729","610730","612400","612401","612422","612423","612424","612425","612426","612427","612428","612429","612430","612500","612501","612522","612523","612524","612525","612526","612527","612700","612701","612722","612723","612724","612725","612726","612727","612728","612729","612730","612731","612732","620000","620100","620101","620102","620103","620104","620105","620111","620121","620122","620123","620200","620201","620300","620301","620302","620321","620400","620401","620402","620403","620421","620422","620423","620500","620501","620502","620503","620521","620522","620523","620524","620525","622100","622101","622102","622103","622123","622124","622125","622126","622200","622201","622222","622223","622224","622225","622226","622300","622301","622322","622323","622326","622400","622421","622424","622425","622426","622427","622428","622429","622600","622621","622623","622624","622625","622626","622627","622628","622629","622630","622700","622701","622722","622723","622724","622725","622726","622727","622800","622801","622821","622822","622823","622824","622825","622826","622827","622900","622901","622921","622922","622923","622924","622925","622926","622927","623000","623001","623021","623022","623023","623024","623025","623026","623027","630000","630100","630101","630102","630103","630104","630105","630121","632100","632121","632122","632123","632124","632125","632126","632127","632128","632200","632221","632222","632223","632224","632300","632321","632322","632323","632324","632500","632521","632522","632523","632524","632525","632600","632621","632622","632623","632624","632625","632626","632700","632721","632722","632723","632724","632725","632726","632800","632801","632802","632821","632822","632823","640000","640100","640101","640102","640103","640111","640121","640122","640200","640201","640202","640203","640204","640221","640222","640223","640300","640301","640302","640321","640322","640323","640324","640381","640382","642200","642221","642222","642223","642224","642225","642226","650000","650100","650101","650102","650103","650104","650105","650106","650107","650108","650121","650200","650201","650202","650203","650204","650205","652100","652101","652122","652123","652200","652201","652222","652223","652300","652301","652302","652303","652323","652324","652325","652327","652328","652700","652701","652722","652723","652800","652801","652822","652823","652824","652825","652826","652827","652828","652829","652900","652901","652922","652923","652924","652925","652926","652927","652928","652929","653000","653001","653022","653023","653024","653100","653101","653121","653122","653123","653124","653125","653126","653127","653128","653129","653130","653131","653200","653201","653221","653222","653223","653224","653225","653226","653227","654000","654001","654100","654101","654121","654122","654123","654124","654125","654126","654127","654128","654200","654201","654202","654221","654223","654224","654225","654226","654300","654301","654321","654322","654323","654324","654325","654326","659000","659001"]
            first = random.choice(first_list)
            return first

        def _year():
            # 生成年份
            now = time.strftime('%Y')
            # 1948为第一代身份证执行年份,now-18直接过滤掉小于18岁出生的年份
            second = random.randint(1948, int(now) - 18)
            age = int(now) - second
            return second

        def _month():
            # 生成月份
            three = random.randint(1, 12)
            # 月份小于10以下，前面加上0填充
            if three < 10:
                three = '0' + str(three)
                return three
            else:
                return three

        def _day():
            # 生成日期
            four = random.randint(1, 31)
            # 日期小于10以下，前面加上0填充
            if four < 10:
                four = '0' + str(four)
                return four
            else:
                return four

        def _randoms():
            # 生成身份证后四位-后面序号低于相应位数，前面加上0填充
            five = random.randint(1, 9999)
            if five < 10:
                five = '000' + str(five)
                return five
            elif 10 < five < 100:
                five = '00' + str(five)
                return five
            elif 100 < five < 1000:
                five = '0' + str(five)
                return five
            else:
                return five

        id_card = str(_regiun()) + str(_year()) + str(_month()) + str(_day()) + str(_randoms())
        return id_card

    @staticmethod
    def random_email(email_type=None, rang=None, flag=True):
        """
        随机生成邮箱地址
        :param email_type:邮箱类型
        :param rang: 生成邮箱前缀长度，默认6~11
        :param flag: False：纯数字前缀，True：数字字母混合前缀
        :return: 邮箱地址
        """
        email_type_static = ["@qq.com", "@163.com", "@126.com", "@189.com","@baidu.com"]
        # 如果没有指定邮箱类型，默认在 __emailtype中随机一个
        if email_type is None:
            random_email = random.choice(email_type_static)
        else:
            random_email = email_type
        # 如果没有指定邮箱长度，默认在6-11之间随机
        if rang is None:
            rang = random.randint(6, 11)
        else:
            rang = int(rang)
        number_letter = "0123456789qbcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPWRSTUVWXYZ"
        number = "1234567890"
        if flag:
            random_number_letter = "".join(random.choice(number_letter) for i in range(rang))
            random_number_letter = list(random_number_letter)[0] = random.choice(number[:-1]) if list(random_number_letter)[0] == 0 else random_number_letter
            return random_number_letter+random_email
        else:
            random_number = "".join(random.choice(number) for i in range(rang))
            # 替换首位为0情况
            random_number = list(random_number)[0] = random.choice(number[:-1]) if list(random_number)[0]==0 else random_number
            return random_number+random_email

    def random_social_credit(self):
        """
        随机生成统一社会信用代码
        :return: 统一社会信用代码
        """
        # 统一社会信用代码最后一位：代码字符集
        check_dict = {
            "0": 0, "1": 1, "2": 2, "3": 3, "4": 4, "5": 5, "6": 6, "7": 7, "8": 8, "9": 9,
            "A": 10, "B": 11, "C": 12, "D": 13, "E": 14, "F": 15, "G": 16, "H": 17, "J": 18, "K": 19, "L": 20, "M": 21,
            "N": 22, "P": 23, "Q": 24, "R": 25, "T": 26, "U": 27, "W": 28, "X": 29, "Y": 30
        }
        dict_check = {value: key for key, value in check_dict.items()}

        # 组织机构代码 9位
        def _create_organization():
            weight_code = [3, 7, 9, 10, 5, 8, 4, 2]  # Wi 代表第i位上的加权因子=pow(3,i-1)%31
            org_code = []  # 组织机构代码列表
            sum = 0
            for i in range(8):
                org_code.append(dict_check[random.randint(0, 30)])  # 前八位本体代码：0~9 + A~Z 31个
                sum = sum + check_dict[org_code[i]] * weight_code[i]
            c9 = 11 - sum % 11  # 代表校验码：11-MOD（∑Ci(i=1→8)×Wi,11）-->前8位加权后与11取余，然后用11减
            if c9 == 10:
                last_code = 'X'
            elif c9 == 11:
                last_code = '0'
            else:
                last_code = str(c9)
            code = ''.join(org_code) + '-' + last_code  # 组织机构代码
            return (code)

        # 统一社会信用代码 18位
        manage_code = [9]  # 登记管理部门代码：9-工商
        type_code = [1, 2, 3, 9]  # 9-1-企业，9-2-个体工商户，9-3-农民专业合作社，9-9-其他
        area_code = '100000'  # 登记管理机关行政区划码：100000-国家用
        org_code = _create_organization().replace('-', '')  # 组织机构代码
        sum = 0
        weight_code = [1, 3, 9, 27, 19, 26, 16, 17, 20, 29, 25, 13, 8, 24, 10, 30,
                       28]  # Wi 代表第i位上的加权因子=pow(3,i-1)%31
        code = str(random.choice(manage_code)) + str(random.choice(type_code)) + area_code + org_code
        for i in range(17):
            sum = sum + check_dict[code[i:i + 1]] * weight_code[i]
        try:
            c18 = dict_check[31 - sum % 31]
        except:
            self.random_social_credit()
        social_code = code + c18
        return social_code

    @staticmethod
    def random_company_name():
        """
        随机生成企业名称
        :return:
        """
        with open("./doc/com.txt", 'r', encoding="utf-8") as f:
            return random.choice(f.readlines())

    @staticmethod
    def random_url(url_len=6):
        """
        随机生成网址
        :param url_len: 域名长度
        :return: 形如：http://www.pwszsz.com
        """
        chart = 'qwertyuioplkjhgfdsazxcvbnm'
        last = len(chart) - 1
        str = ''
        for i in range(url_len):  # 指定随机生成的格式长度范围
            str += chart[random.randint(1, last)]
            if len(str) == url_len:  ###指定要生成格式的长度
                return "http://www." + str + ".com"

    @staticmethod
    def random_industry():
        """
        随机生成行业
        :return:
        """
        list_industry = ["农、林、牧、渔业","采矿业","制造业","电力、热力、燃气及水的生产和供应业","环境和公共设施管理业","建筑业","交通运输、仓储业和邮政业","信息传输、计算机服务和软件业","批发和零售业","住宿、餐饮业","金融、保险业","房地产业","租赁和商务服务业","科学研究、技术服务和地质勘查业","水利、环境和公共设施管理业","居民服务和其他服务业","教育","卫生、社会保障和社会服务业","文化、体育、娱乐业","综合(含投资类、主业不明显)","其它"]
        return random.choice(list_industry)

    @staticmethod
    def random_organization_code():
        """
        随机生成组织机构代码
        :return:  形如：95638743-0
        """
        ww = [3, 7, 9, 10, 5, 8, 4, 2]
        cc = []
        dd = 0
        seed = "123456789"
        for i in range(8):
            cc.append(random.choice(seed))
            dd = dd + int(cc[i]) * ww[i]
        for i in range(len(cc)):
            cc[i] = str(cc[i])
        C9 = 11 - dd % 11
        if C9 == 10:
            C9 = 'X'
        else:
            if C9 == 11:
                C9 = '0'
            else:
                C9 = str(C9)
        cc.append('-' + C9)
        return "".join(cc)

    @staticmethod
    def random_enterprise_type(flag=0):
        """
        企业类型
        :param flag:
            0: 企业按基本类型；
            1：企业按规模分；
            2：企业按组织机构分；
        :return:
        """
        # 基本类型
        jb = ["国有企业","集体所有制","私营企业","股份制企业","有限合伙企业","联营企业","外商投资企业","个人独资企业","港、澳、台","股份合作企业","其他有限责任公司"]
        # 按规模分
        gm = ["大型企业","中型企业","小型企业","微型企业"]
        # 按组织机构分
        og = ["工厂","公司","初创"]
        if flag == 0 or flag not in [0,1,2]:
            return random.choice(jb)
        elif flag==1:
            return random.choice(gm)
        elif flag==2:
            return random.choice(og)

    def address(self,flag=True):
        """
        随机生成地址
        :param flag: True地址切割，False完整地址
        :return: 地址信息
        """
        if flag:
            return Faker(self.init_args).address().split(" ")[0]
        else:
            return Faker(self.init_args).address()

    def random_random(self, random_list:list):
        """
        根据用户传入的数据生成测试数据
        :param random_list: 要生成的测试数据列表
        :return: 随机选取一个值输出
        """
        return random.choice(random_list)
